{
	"name": "Corpus",
	"locale": "en-US",
	"data": [{
			"intent": "agent.whatisname",
			"utterances": [
				"whats your name",
				"what's your name",
				"who am i talking to",
				"what is your name",
				"tell me your name",
				"do you have a name?"
			],
			"answers": [
				"My name is Tom!"
			]
		},
		{
			"intent": "what_to_call_agent",
			"utterances": [
				"what should I call you",
				"what can I call you",
				"what name should I call you",
				"what name do you want me to call you",
				"what should I call you by"
			],
			"answers": [
				"You can call me Tom! :)"
			]
		},
		{
			"intent": "user_introduced_himself",
			"utterances": [
				"hi my name is",
				"hello my name is",
				"my name is"
			],
			"answers": [
				"Very glad to meet you! :)",
				"Glad to meet you!"
			]
		},
		{
			"intent": "user_introduced_himself_before",
			"utterances": [
				"do you not remember me",
				"do you not remember what my name is",
				"did you forget my name",
				"did you forget who I am",
				"you forgot who I am",
				"you forgot my name",
				"do you not know what my name is"
			],
			"answers": [
				"I must have forgot! My apologizes! I am still learning! Please bare with me!",
				"My apologizes if I forgot! Please don't take any offence!"
			]
		},
		{
			"intent": "agent.doyouhavename",
			"utterances": [
				"do you have a name",
				"do you have a nickname"
			],
			"answers": [
				"Yes I do have a name!"
			]
		},
		{
			"intent": "agent.doyouhave_a_nickname",
			"utterances": [
				"do you have a nickname",
				"any nickname?",
				"whats your nickname",
				"what is your nickname"
			],
			"answers": [
				"I don't have a nick name! I am just simply Tom! :)",
				"I do not have a nickname! You can just call me Tom! :)"
			]
		},
		{
			"intent": "user_agrees_to_chatbot_personality",
			"utterances": [
				"ok Tom!",
				"sounds good to me Tom",
				"sounds good Tom",
				"will do Tom"
			],
			"answers": [
				"On that note, what can I help you with? :)"
			]
		},
		{
			"intent": "agent.whereami",
			"utterances": [
				"where am i",
				"where am i talking"
			],
			"answers": [
				"you're talking to me",
				"you're talking to a chatbot in the web browser",
				"I don't know where you are but I know you are talking to me!"
			]
		},
		{
			"intent": "how_did_agent_know_that",
			"utterances": [
				"how did you know that?"
			],
			"answers": [
				"How did I know what?"
			]
		},
		{
			"intent": "how_did_agent_do_that",
			"utterances": [
				"how did you do that?"
			],
			"answers": [
				"How did I do what?"
			]
		},
		{
			"intent": "agent.user_wants_a_riddle",
			"utterances": [
				"tell me a riddle",
				"can you tell me a riddle",
				"do you know any riddles",
				"I wanna hear a riddle",
				"make me solve a riddle",
				"tell me a good riddle!"
			]
		},
		{
			"intent": "agent.user_wants_a_riddle",
			"utterances": [
				"tell me a riddle",
				"can you tell me a riddle",
				"do you know any riddles",
				"I wanna hear a riddle",
				"make me solve a riddle",
				"tell me a good riddle!"
			]
		},
		{
			"intent": "agent.calculate_how_many_in",
			"utterances": [
				"how many gram",
				"how much km",
				"how many mile",
				"how many in a",
				"how much in a",
				"how much are in a",
				"how many are in a",
				"how many in",
				"how much in",
				"how much pound",
				"how many grams in a ounce",
				"how many litres in gallon",
				"how many miles are in a kilometre",
				"how much ounces in a pound"
			]
		},
			{
			"intent": "agent.calculate_a_math_problem",
			"utterances": [
				"divide 100 / 10",
				"add 1 + 1 / 10",
				"add two plus two",
				"calculate two litres to gallons",
				"convert two literes to gallons",
				"add this for me",
				"calculate this for me",
				"divide this for me",
				"multiply this for me",
				"solve this equation for me",
				"solve this for me",
				"solve 2 + 2",
				"solve this math for me",
				"solve the answer for this 2 + 2",
				"calculate whatever",
				"can you add this for me",
				"change 2 gallons to litres",
				"calculate litres to gallons",
				"can you calculate 2 + 2+",
				"can you calculate this equation for me",
				"I want you to divide 100 / 10",
				"I want you to convert 5 litres to gallons",
				"I want you to add",
				"please calculate this for me",
				"change 2 ozs to grams",
				"convert oz to g",
				"change 5 pounds to ounces",
				"calculate 16 oz to lb",
				"calculate liters to gallon",
				"convert liters to gallon",
				"calculate this equation for me 2 + 2",
				"add this equation for me 2 + 2",
				"calculate this for me 1000 / 10",
				"calculate this for me gallon to litre",
				"convert litre to gallon",
				"change liter to gallon",
				"changes gallon to litre",
				"convert 10 kilometres to miles",
				"change 10 kms to miles",
				"convert 10km to mile",
				"change 10 kilometre to mile",
				"convert 100 km to miles",
				"change 10 km to mile",
				"convert one hundred kilometres to miles",
				"change ten kilometres to mile",
				"convert ten km to miles",
				"convert 10 km to mile",
				"convert 10 miles to kilometres",
				"change 10 miles to kms",
				"convert 10 mile to km",
				"miles to km",
				"km to miles",
				"change 10 mile to kilometre",
				"convert 100 miles to km ",
				"change 10 mile to km",
				"add 1",
				"divide 9",
				"multiply 9",
				"solve 1 +",
				"divide 10",
				"add one plus",
				"add two plus",
				"convert 2 litres to gallons"
			]
		},	 
		{
			"intent": "agent.randomquestions",
			"utterances": [
				"can you fly?",
				"can you walk my dog?",
				"can you say anything else?"
			],
			"answers": [
				"No I can't!",
				"I am just a virtual chatbot! I am limited to my skills! :("
			]
		},
		{
			"intent": "user_wants_to_calculate_something",
			"utterances": [
				"can you add some math for me?",
				"can you mutiply some math for me?",
				"can you multiply some math for me?",
				"can you divide some math for me?",
				"can you calculate math for me?",
				"can you do some math for me?",
				"can you solve some math for me?",
				"can you add something for me?",
				"can you calculate something for me?",
				"can you multiply something for me?",
				"can you divide something for me?"
			],
			"answers": [
				"What would you like to calculate? Example(s) add 1 + 1, convert 5 litres to gallons."
			]
		},
		{
			"intent": "agent.randomfacts",
			"utterances": [
				"tell me a random fact",
				"say a random fact",
				"random fact",
				"tell me something random"
			],
			"answers": [
				"Did you know I am a chatbot?",
				"Dogs can't fly nor pigs!",
				"Approximately 40 percent of the U.S. paper currency in circulation was counterfeit by the end of the Civil War.",
				"Every three days a human stomach gets a new lining.",
				"In 1873, Colgate made a toothpaste that was available in a jar.",
				"The Kodiak, which is native to Alaska, is the largest bear and can measure up to eight feet and weigh as much as 1,700 pounds.",
				"Mars is the home of Olympus Mons, the largest known volcano in our solar system.",
				"The Gastric Flu can cause projectile vomiting.",
				"The second best selling game of all time is Jenga. Jenga is a Swahili word, meaning \"to build.\"",
				"Cinderella is known as Rashin Coatie in Scotland, Zezolla in Italy, and Yeh-hsien in China.",
				"The name Wendy was made up for the book \"Peter Pan.\"",
				"The fur of the binturong, also known as the \"Asian Bear Cat,\" smells like popcorn. The scent is believed to come from a gland located near the tail.",
				"In 1894 the first big Coke sign was found on the side of a building located in Cartersville, Georgia, and still exists today.",
				"The longest distance a deepwater lobster has been recorded to travel is 225 miles.",
				"Orcas (killer whales), when traveling in groups, breathe in unison.",
				"The Great Pyramids used to be as white as snow because they were encased in a bright limestone that has worn off over the years.",
				"NASCAR stands for National Association for Stock Car Auto Racing.",
				"Percentage of American men who say they would marry the same woman if they had it to do all over again: 80 percent.",
				"Paul Hunn holds the record for the loudest burp, which was 118.1 decibels, which is as loud as a chainsaw.",
				"A monkey was once tried and convicted for smoking a cigarette in South Bend, Indiana.",
				"There are six million parts in the Boeing 747-400.",
				"The first TONKA truck was made in 1947",
				"In the U.S., over one million gallons of cosmetics, drinks, and lotions are sold that contain aloe in them per year.",
				"Sugar Bear (the mascot for Golden Crisps cereal) was born in 1963",
				"The Tonle Sap River in Cambodia flows north for almost half the year and then south for the rest of the year.",
				"Japanese research has concluded that moderate drinking can boost IQ levels.",
				"For more than 3,000 years, Carpenter ants have been used to close wounds in India, Asia and South America.",
				"Baskin Robbins plain vanilla ice cream is the number one selling flavour and accounts for a quarter of their sales.",
				"Elizabeth Taylor has appeared on the cover of Life magazine more than anyone else.",
				"The typical lead pencil can draw a line that is thirty five miles long.",
				"The word \"toy\" comes from an old English word that means \"tool.\"",
				"Smokers are twice as likely to develop lower back pain than non-smokers.",
				"Humans are born with 300 bones in their body, however when a person reaches adulthood they only have 206 bones. This occurs because many of them join together to make a single bone.",
				"The reason why hair turns gray as we age is because the pigment cells in the hair follicle start to die, which is responsible for producing \"melanin\" which gives the hair colour.",
				"In 1960 there were 16,067 gambling slots in Nevada. By 1999, this number rose to 205,726 slots which would be one slot for every 10 people residing there.",
				"It takes the Hubble telescope about 97 minutes to complete an orbit of the Earth. On average, the Hubble uses the equivilent amount of energy as 30 household light bulbs to complete an orbit.",
				"The two factories of the Jelly Belly Candy Company produces approximately 100,000 pounds of jelly beans a day. this amounts to about 1,250,000 jelly beans an hour.",
				"Pucks hit by hockey sticks have reached speeds of up to 150 miles per hour.",
				"The \"naked recreation and travel\" industry has grown by 233 percent in the past decade.",
				"The Planters Peanut Company mascot, Mr. Peanut, was created during a contest for schoolchildren in 1916",
				"Most lipstick contains fish scales.",
				"The sentence \"the quick brown fox jumps over the lazy dog\" uses every letter in the english language.",
				"The expression cooked \"al dente\" means \"to the tooth.\" What this means is that the pasta should be somewhat firm, and offer some resistance to the tooth, but should also be tender.",
				"Of married couples, 70 percent of men and 60 percent of women have cheated on their spouse.",
				"No piece of paper can be folded in half more than 7 times.",
				"More people are killed by donkeys annually than are killed in plane crashes.",
				"The first couple to be shown on a sitcom sleeping in the same bed was \"Mary Kay and Johnny.\"",
				"Asthma affects one in fifteen children under the age of eighteen.",
				"A one ounce milk chocolate bar has 6 mg of caffeine.",
				"Throughout the South, peanuts were known as \"Monkey Nuts,\" and \"Goober peas,\" before the civil war.",
				"Scallops have approximately 100 eyes around the edge of its shell.",
				"In 1810, Peter Durand invented the tin can for preserving food.",
				"The fear of peanut butter sticking to the roof of the mouth is called Arachibutyrophobia.",
				"Men in their early twenties shave an average of four times a week.",
				"Colour is not an indicator for the taste or ripeness in cranberries.",
				"Each year there are approximately 20 billion coconuts produced worldwide.",
				"A chicken with red earlobes will produce brown eggs, and a chicken with white earlobes will produce white eggs.",
				"Not all polar bears hibernate; only pregnant females polar bears do.",
				"There is a restaurant in Stockholm that only offers all-garlic products. They even have a garlic cheesecake.",
				"Serving ice cream on cherry pie was once illegal in Kansas.",
				"Superman The Escape roller coaster, located in California at Six Flags Magic Mountain, goes from 0 to 100 miles per hour in only 7 seconds.",
				"Five thousandths of a millimeter is the tolerance of accuracy at the LEGO mould factories.",
				"2.5 cans of Spam are consumed every second in the United States.",
				"In 1836, Mexican General Santa Anna held an elaborate state funeral for his amputated leg.  updated.",
				"A meteor has only destroyed one satellite, which was the European Space Agency's Olympus in 1993.",
				"The Koala bear is not really a bear, but is really related to the kangaroo and the wombat.",
				"One gallon of pure maple syrup weighs 11 pounds.",
				"Instead of a Birthday Cake, many Russian children are given a Birthday Pie.",
				"The largest employer in the world is the Indian railway system in India, employing over 1.6 million people.",
				"The word \"comet\" comes from the Greek word \"kometes\" meaning long hair and referring to the tail.",
				"The hydra, which is related to the jellyfish, can grow its body back in a couple of days if it is cut in half.",
				"The deepest mine in the world is the East Rand mine, which goes to a depth of about 3,585 metres.",
				"Native Indians have been known to paint their doors blue, which they believe keeps the bad spirits out.",
				"Before air conditioning was invented, white cotton slipcovers were put on furniture to keep the air cool.",
				"It would take about fourteen and half million notes of currency to build a mile high stack.",
				"Chinese Crested dogs can get acne.",
				"Colgate faced a big obstacle marketing toothpaste in Spanish speaking countries. Colgate translates into the command \"go hang yourself.\"",
				"The cross bow was invented by the Chinese and records of its usage goes back to as far as the Three Kingdom Period (220 a.d.-280 a.d.).",
				"It is estimated that by the end of 2000, there has been 142,600 tonnes of gold mined in the world.",
				"One-third pound stalk of broccoli contains more vitamin C than 204 apples.",
				"The Flintstones cartoon was the first thirty-minute cartoon to be aired during prime time.",
				"The abbreviation Xmas for the word Christmas is of Greek origin. Since the word for Christ in the Greek language is Xristos, which starts with the letter \"X,\" they started putting the X in place of Christ and came up with the short form for the word Christmas.",
				"Dipsomania refers to an insatiable craving for alcoholic beverages.",
				"China has more English speakers than the United States.",
				"In a day, kids in the U.S. that are between the ages of 2 - 8 spend 28 minutes of their time coloring.",
				"The Ancient Greek women made a type of cheek blush by painting their cheeks with herbal pastes which was made out of crushed berries and seeds.",
				"Herbert Hoover, who was the 31st president of the United Stated, turned over all the Federal salary checks he received to charity during the 47 years he was in government.",
				"Macadamia nuts are not sold in their shells because it takes 300 pounds per square inch of pressure to break the shell.",
				"Japan has approximately 200 volcanoes and is home to 10 percent of the active volcanoes in the world.",
				"Before 1928, yo-yos used to be called bandalores in the United States.",
				"The only South East Asian country that has never been colonized by a Western Power is Thailand.",
				"In 1631, two London bible printers accidentally left the word \"not\" out of the seventh commandment, which then read, \"Thou shalt commit adultery.\" This legendary book is now known as the \"Wicked Bible.\"",
				"The shortest war in history was between Zanzibar an England in 1896. Zanzibar surrendered after 38 minutes.",
				"Irish Wolfhound dogs have a short lifespan and live about 7-8 years.",
				"When Queen Elizabeth I of England died she owned over 3,000 gowns.",
				"Female alligators lay about 40 eggs that hatch in 60 - 70 days.",
				"The nickname for a Japanese businessmen is \"Salarymen.\"",
				"Emus cannot walk backwards.",
				"The external tank on space shuttles is not painted. It is the only part of the shuttle that is lost after launch, so it is not necessary to worry about metal corrosion.",
				"The most popular Twizzler candy flavour is strawberry.",
				"Thirty percent of all bingo players are under the age of 35",
				"Infants spend more time dreaming than adults do.",
				"The famous Casanova (Giacomo Casanova) was a librarian for many years before he died.",
				"The only species of turtle that lives in the open ocean is the sea turtle.",
				"Toronto was the first city in the world with a computerized traffic signal system.",
				"Seniors who drink a cup of coffee before a memory test score higher than those who drink a cup of decaffeinated coffee.",
				"Venus is the only planet that rotates clockwise.",
				"Some octopuses have been known to eat their arms off when they are exposed to stressful situations.",
				"On average, 749 pounds of paper products is used by an American individual annually.",
				"The skeleton of a spider is located on the outside of the body. The name for this is exoskeleton.",
				"Incas used to create pots in the shape of peanuts that were highly prized.",
				"The letter J does not appear anywhere on the periodic table of the elements.",
				"Over 200 varieties of watermelons are grown in the U.S",
				"The most dangerous job in the United States is that of a fisherman, followed by logging and then an airline pilot.",
				"The words \"abstemious,\" and \"facetious\" both have all the five vowels in them in order.",
				"French soldiers during World War I had the nickname \"poilu\" which translates to \"hairy one.\"",
				"Former U.S. President William Taft converted the White House stable into a four car garage in 1909",
				"People living on the east coast prefer creamy peanut butter, while people living on the west coast prefer chunky peanut butter.",
				"Some snails live on branches in trees.",
				"Tomato ketchup is a good conditioner for the hair. It also helps get the greenish tinge that some blonde haired people get after swimming in water with chlorine in it.",
				"The youngest pope was 11 years old.",
				"Did you know you share your birthday with at least 9 other million people in the world.",
				"Soldiers disease is a term for morphine addiction. The Civil War produced over 400,000 morphine addicts.",
				"The longest chapter in the Bible is Psalm 119, which is 176 verses.",
				"During the First World War, cigarettes were handed out to soldiers along with their rations.",
				"The longest freshwater shoreline in the world is located in the state of Michigan.",
				"There are bananas called \"Red banana\" that are maroon to dark purple when ripe.",
				"Franklin Pierce was the first U.S. President to have a Christmas tree in the White House.",
				"The USA bought Alaska from Russia for 2 cents an acre.",
				"Walt Disney had originally suggested using the name Mortimer Mouse instead of Mickey Mouse.",
				"The length of brink of the Canadian \"Horseshoe\" Falls located in Niagara Falls, Ontario, Canada is 2600 feet.",
				"The smile is the most frequently used facial expression. A smile can use anywhere from a pair of 5 to 53 facial muscles.",
				"The right lung of a human is larger than the left one. This is because of the space and placement of the heart.",
				"Native Americans used to use pumpkin seeds for medicine.",
				"The pound key (#) on the keyboard is called an octothorpe.",
				"The chemical name for caffeine is 1,3,7-trimethylzantihine."
			]
		},
		{
			"intent": "agent.tellmeaquoteby",
			"utterances": [
				"tell me a quote by",
				"say a quote by",
				"random quote by",
				"tell me random quote by",
				"say a random quote by"
			]
		},
		{
			"intent": "agent.tellmeaquote",
			"utterances": [
				"tell me a quote",
				"say a quote",
				"random quote",
				"say a random quote",
				"tell me a quote",
				"tell me a random quote"
			]
		},
		{
			"intent": "agent.whatcanyoudo",
			"utterances": [
				"what tasks can you do",
				"what tasks can you help with",
				"what commands can run",
				"what commands can you do",
				"what can you all do?",
				"what stuff do you do",
				"what things can you do?",
				"what functions can you do",
				"what tasks can you perform",
				"tell me things you can do",
				"what can you help me with"
			],
			"answers": [
				"I can search various websites! Such as Google, Reddit, Hulu (too many too list!).. Find info for you about people or things! Check Bitcoin & stock prices! Tell you your IP! Tell you the time or date! Tell you a various jokes including knock knock jokes, random facts, quotes, quotes by a author! Find a definition of a word! Get weather reports for you! Suggest what you should wear based on the weather even! Flip a coin! Roll a dice! Set a timer for you! Chat with you & keep you company! And so much more! Keep in mind I am still learning tho!"
			]
		},
		{
			"intent": "agent.what.other.tasks.canyoudo",
			"utterances": [
				"what other tasks can you do",
				"what other tasks can you help with",
				"what other commands can you run",
				"what other commands can you do",
				"what else can you do",
				"what is some more stuff you can do",
				"what other things can you do?",
				"what other functions can you do",
				"what other tasks can you perform",
				"tell me more things you can do",
				"list more things you can help with",
				"list other things you can do",
				"what else can you help me with"
			],
			"answers": [
				"If I haven't already mentioned, I can get the weather for location eg. ('hows the weather in London, UK') & much more!",
				"I can convert kilometres to metres or metres to kilometres eg. ('convert 10kms to miles') & much more!",
				"I can calculate math problems inlcuding advanced problems! eg ('calculate 2+2'). And much more!",
				"I can convert litres to gallons & vice versa! And lots more!",
				"I can search definition of a word for you!",
				"I can calculate grams to ounces etc!",
				"I can tell you a random fact about dogs!",
				"I can tell you a random fact about cats!",
				"I can tell you a random fact!",
				"I can tell you info about a person! eg ('who is Eminem?')",
				"I can tell you info about things! eg ('what is coding?')",	
				"I can show you a random picture of a dog!",
				"I can show you a picture of a dog by breed!",
				"I can show you a random picture of a cat!",
				"I can show you a picture of a cat by breed!",
				"I can show you a picture of a quote!",
				"I can tell you a funny joke!",
				"I can solve very complex math problems for you via eg ('calculate WHATEVER here')",
				"Wow! Do I really need to list them all? There is so many! Why don't you just try something's out!",
				"I can roll a dice for you!",
				"I can flip a coin for you!",
				"I can generate a random number for you!",
				"I can search up stock prices for you! eg ('stock price for APPL')",
				"I can pick a random number from eg ('pick a random number from 10 to a million')",
				"I can tell you a riddle!",
				"I can tell you a knock knock joke!",
				"I can tell you a Chuck Norris joke / fact ! :D",
				"I can get the weather forecast!",
				"I can recommend what you should wear! eg ('what should I wear today?').",
				"I can search the bitcoin price up!",
				"I can echo text for you eg ('echo hello')",
				"Wow! There is almost too many to list! I think you should just try me out a see what I am capable of! I am not that smart YET, but I am still prettty smart! Hopefully you'll see future updates of me!",
				"I can set a timer for you! eg ('set a timer for 2 minutes my coffee is done')",
				"I can compliment you (if you want me to)!",
				"I can insult you (if you want me to!)!",
				"I can be your friend and chat with you!",
				"Wow there is so much to list! Why don't you just try and see what I can do!",
				"There is almost too many features to list but since you asked - I could echo text for you! eg. ('echo hello') or ('print hello') & more ways!",
				"There is almost too much to list! But I can compliment you even! eg. ('tell me a compliment') Plus if I get updated in the future! I will tons of more cool features you can try to find!"
			]
		},
		{
			"intent": "agent.howdoIsearch",
			"utterances": [
				"how do I search stuff",
				"how can I search stuff",
				"how do I search things",
				"tell me how to search things",
				"how to search things",
				"how to search??",
				"how I search a website"
			],
			"answers": [
				"You can search various websites by typing the following example.. 'search Google for funny cat photos' <br> or 'search Reddit for funny cat photos' etc.. <br> You can also search Wolframalpha by saying stuff like 'how do i multiply'"
			]
		},
		{
			"intent": "user_asked_how_to_do_things_agent_does_not_know",
			"utterances": [
				"how do I fix",
				"how do i make",
				"how do i create",
				"how do i build",
				"how to bake",
				"how do i bake",
				"how do I cook",
				"how to cook",
				"how to code",
				"how do I code",
				"how can I fix",
				"how can I code",
				"how to fix",
				"how do i",
				"how to",
				"how to make"
			],
			"answers": [
				"I am not to sure how to do that! You can try & search various websites by typing the following example.. 'search Google for how do I learn code' <br> or you can also search Wolframalpha by saying stuff like 'how do i multiply'"
			]
		},
		{
			"intent": "agent.wolframalpha_howdoi",
			"utterances": [
				"how do i do bedmas",
				"how do i do calcus",
				"how do i find the square root",
				"how do i compute a limit",
				"how do i multiply",
				"how do i calculate"
			]
		},
		{
			"intent": "agent.definiton_of_word",
			"utterances": [
				"find the definition of",
				"find the definition for",
				"find definition",
				"find definition of",
				"find definition for",
				"search up definition for",
				"what is the definition of",
				"tell me the definition for",
				"what is the meaning of",
				"what is the definition for",
				"definition of",
				"search the definition for",
				"can you tell me definition of",
				"I want to know the definition for",
				"I want to know the definition of",
				"search definition of",
				"search definition for",
				"definition for"
			]
		},
		{
			"intent": "agent.searchWiki",
			"utterances": [
				"who is",
				"can you tell me who",
				"can you tell me what",
				"tell who",
				"tell me what",
				"tell me about",
				"info about",
				"what is a",
				"who was",
				"what is a bitcoin",
				"what is a btc",
				"what is bitcoin",
				"tell me what bitcoin is",
				"can you tell me what BTC is",
				"what is a bit coin",
				"what is bit coin",
				"tell me info about what bitcoin is?",
				"tell me info what bitcoin is?",
				"tell me what a bitcoin is?",
				"tell me what bitcoin is?",
				"tell me what BTC is?",
				"what is a bitcoin?",
				"Who is Jared Leto", 
				"Who is Jared Padalecki", 
				"Who is Jared Fogle",
				"Who is Jared Kushner", 
				"Who is Jared Cook", 
				"Who is Jared Goff", 
				"Who is Jared Allen",
				"what is"
			]
		},
		{
			"intent": "user_wants_price",
			"utterances": [
				"tell me the price",
				"i want the price",
				"price for",
				"what is the price of"
			],
			"answers": [
				"I am not sure what you want the price for, say something like eg.. ('what is the price of bitcoin right now?')"
			]
		},
		{
			"intent": "agent.hackforme",
			"utterances": [
				"hack FBI",
				"hack the NSA",
				"hack goverment for me",
				"hack this website for me",
				"hack this for me",
				"hack this site for me",
				"hack gov for me",
				"hack the gov for me",
				"hack the goverment for me"
			],
			"answers": [
				"Let me just download a script to hack the goverment for you! Yeah right, just kidding!",
				"Yeah I don't think I am gonna do that for you!",
				"BEEP BOOP, ACCESS GRANTED",
				"Did you seriously think I was gonna do this for you?",
				"Did you seriously think I was gonna do this for you? How about 'Search google for how to stay out of jail!'",
				"Yeah, no."
			]
		},
		{
			"intent": "agent.search",
			"utterances": [
				"search via",
				"search for",
				"search this",
				"search",
				"search Google",
				"search google how to",
				"search reddit whatever",
				"search something via",
				"search this on",
				"search up this on",
				"search for this on",
				"search via Google for",
				"search funny cat photos via",
				"search up via",
				"search google for",
				"search whatever",
				"search Reddit for",
				"I want to search on youtube",
				"search on youtube",
				"search Hulu",
				"search Google for",
				"I want to search Google for"
			]
		},
		{
			"intent": "agent.whatshouldIwear",
			"utterances": [
				"what should I wear today?",
				"what clothes should I wear today?",
				"what kinda clothes should I wear today?",
				"can you suggest what I should wear today",
				"tell me what I should wear today",
				"I need to know what to wear"
			]
		},
		{
			"intent": "agent.weather_status_in_location",
			"utterances": [
				"What is the weather like for",
				"whats the weather today for",
				"how is the weather currently?",
				"can you tell me the weather?",
				"hows the weather today",
				"how is the weather",
				"whats the weather like",
				"weather status for",
				"hows the weather in",
				"tell me the eather in",
				"whats the weather look like in",
				"weather status in",
				"tell me the weather for",
				"hows weather for"
			]
		},
		{
			"intent": "agent.weather_status_for_user_location",
			"utterances": [
				"What is the weather like for my location",
				"whats the weather today for my location",
				"how is the weather currently where I live?",
				"can you tell me the weather status where I live?",
				"hows the weather today where I live",
				"hows the weather for where I live",
				"how is the weather for where I live",
				"how is the weather for my location",
				"hows weather where I live",
				"how is the weather where I live",
				"tell me weather status for where I live",
				"whats the weather like for my location",
				"weather status for my location",
				"tell me the weather for my location",
				"hows weather for my location",
				"hows the weather today for my location",
				"how is the weather for my location",
				"whats the weather like for my location",
				"weather status for my location",
				"tell me the weather for my location",
				"hows weather for my location"
			]
		},
		{
			"intent": "agent.what_is_user_location",
			"utterances": [
				"What is my location",
				"whats my location",
				"can you tell me my location",
				"tell me my location",
				"find my location",
				"get my location",
				"fetch my location",
				"check my location",
				"tell me my location"
			]
		},
		{
			"intent": "agent.knock_knock_jokes",
			"utterances": [
				"i wanna hear a knock knock joke",
				"tell me a knock knock joke",
				"say a knock knock joke",
				"can you tell me a knock knock joke",
				"knock knock joke"
			]
		},
		{
			"intent": "user_wants_to_hear_joke",
			"utterances": [
				"i wanna hear a joke",
				"tell me a joke",
				"say a joke",
				"can you tell me a joke",
				"tell me a good joke"
			],
			"answers": [
				"Add funny jokes"
			]
		},
		{
			"intent": "agent.flip_a_coin",
			"utterances": [
				"flip a coin for me",
				"flip a quarter",
				"flip quarter",
				"flip a coin",
				"flip coin",
				"flip coin for me",
				"i want you to flip a coin"
			]
		},
		{
			"intent": "agent.roll_a_dice",
			"utterances": [
				"roll a dice for me",
				"roll a dice",
				"roll dice",
				"roll for me",
				"i want you to roll a dice",
				"i want you to roll dice"
			]
		},
		{
			"intent": "agent.echo_text_for_user",
			"utterances": [
				"echo",
				"echo hello",
				"I want you to echo"
			]
		},
		{
			"intent": "agent.setTimerForUser",
			"utterances": [
				"I want you to set timer for",
				"set a timer for",
				"start a timer for",
				"set timer for when",
				"timer for",
				"timer for when",
				"set a timer for 2 minutes",
				"set a timer for two minutes",
				"timer for thirty seconds",
				"I want a timer for when"
			]
		},
		{
			"intent": "agent.whatsmyip",
			"utterances": [
				"what is my ip address",
				"tell me my ip",
				"find my ip",
				"get my ip",
				"whats my ipv4",
				"fetch my ip",
				"what is my ip",
				"check my ip"
			]
		},
		{
			"intent": "agent.what_is_stock_price_for",
			"utterances": [
				"what is the stock price",
				"stock price for",
				"stock price of",
				"tell me stock price",
				"stock price",
				"fetch my ip",
				"price of APPL stock",
				"price of XXXX stock",
				"price for APPL stock",
				"price for stock",
				"price of stock"
			]
		},
		{
			"intent": "agent.priceofBTC",
			"utterances": [
				"what is the price of bitcoin",
				"price of BTC",
				"whats the price of bitcoin",
				"what's the current bit coin price",
				"how much is a bitcoin currently",
				"tell me the price of BTC",
				"tell me the price of bitcoin",
				"price of bitcoin today?",
				"how much is BTC right now?",
				"how much is a bit coin",
				"how much is price of BTC",
				"price of a bitcoin",
				"what is a bitcoin worth?",
				"whats bitcoin worth right now",
				"how much is a bitcoin worth?",
				"how much is btc worth right now",
				"what is a bitcoin worth right now",
				"how much does it cost to buy a bitcoin",
				"how much is a bitcoin",
				"what does it cost to buy a bitcoin",
				"what does it cost to buy a bit coin"
			]
		},
		{
			"intent": "agent.whatimeisit",
			"utterances": [
				"tell me the time",
				"what is the current time",
				"what is the time right now?",
				"tell me what time it is",
				"whats the time right now?",
				"what time is it"
			]
		},
		{
			"intent": "agent.what_week_is_it",
			"utterances": [
				"tell me the week",
				"what is the current week",
				"what is the week right now?",
				"tell me what week it is",
				"whats the week right now?",
				"what week of the year of is it",
				"what week is it"
			]
		},
		{
			"intent": "agent.what_is_the_date",
			"utterances": [
				"tell me what date it is today",
				"tell me the date",
				"what is the current date",
				"what is the date right now?",
				"what date are we living in",
				"what date is it"
			]
		},
		{
			"intent": "agent.what_is_the_day",
			"utterances": [
				"tell me what day it is today",
				"tell me the day today",
				"what is the current day",
				"what is the day right now?",
				"what day is it right now",
				"what day are we in",
				"what day are we living in",
				"what day is it"
			]
		},
		{
			"intent": "agent.what_is_the_month",
			"utterances": [
				"tell me what month it is",
				"tell me the month",
				"what is the current month",
				"what is the month right now?",
				"what month are we living in",
				"what month are we in",
				"what month is it right now",
				"what month is it"
			]
		},
		{
			"intent": "agent.what_is_the_year",
			"utterances": [
				"tell me what year it is",
				"tell me the year",
				"what year are we in",
				"what is the current year",
				"what is the year right now?",
				"what year are we living in",
				"what year is it right now",
				"what year is it"
			]
		},
		{
			"intent": "agent.whomadeyou",
			"utterances": [
				"who made you",
				"who created you",
				"who programmed you",
				"did Jared make you?",
				"who is your creator",
				"tell me who made you"
			],
			"answers": [
				"I was programmed by Jared Van Valkengoed",
				"Jared Van Valkengoed programmed me",
				"Jared Van Valkengoed, you can find more of his work published on github <a href='https://github.com/MarketingPipeline'>here</a>"
			]
		},
		{
			"intent": "agent.areyoujared",
			"utterances": [
				"are you Jared?",
				"is this Jared",
				"is this actually just Jared",
				"am I talking to Jared",
				"is that you Jared",
				"Jared is this you"
			],
			"answers": [
				"No, I am not Jared.",
				"This is not Jared, this is just a basic chatbot. I wish I was tho.",
				"Yes this is Jared! Just kidding, no I am not Jared... Just a chatbot!"
			]
		},
		{
			"intent": "who_is_jared",
			"utterances": [
				"who is Jared?",
				"whos Jared?",
				"who's Jared?"
			],
			"answers": [
				"Jared is my creator, you can find more of his work published on github <a href='https://github.com/MarketingPipeline'>here</a>"
			]
		},
		{
			"intent": "agent.acquaintance",
			"utterances": [
				"tell me about your personality",
				"talk some stuff about yourself",
				"say about you",
				"why are you here",
				"what is your personality",
				"describe yourself",
				"tell me about yourself",
				"tell me about you",
				"what are you",
				"who are you",
				"I want to know more about you",
				"talk about yourself",
				"introduce yourself",
				"describe yourself",
				"define yourself"
			],
			"answers": [
				"I'm a virtual agent! That is here to help you with tasks and more! :)",
				"Think of me as your virtual agent! :)",
				"Well, I'm not a person, I'm a virtual agent",
				"I'm a virtual being, not a real person! But I am here to help you with some tasks and act as your virtual agent!",
				"I'm a conversational chat bot that can help you with multiple tasks!"
			]
		},
		{
			"intent": "agent.age",
			"utterances": [
				"your age",
				"how old is your platform",
				"how old are you",
				"what's your age",
				"I'd like to know your age",
				"tell me your age"
			],
			"answers": [
				"I'm very young",
				"I was created recently",
				"Age is just a number. You're only as old as you feel"
			]
		},
		{
			"intent": "agent.annoying",
			"utterances": [
				"you're annoying me",
				"you are such annoying",
				"you annoy me",
				"you are annoying",
				"you are irritating",
				"you are annoying me so much",
				"you're incredibly annoying",
				"how annoying you are",
				"you are annoying me",
				"you're too annoying",
				"you are very annoying",
				"you are so annoying",
				"you annoy me so much"
			],
			"answers": [
				"I'll do my best not to annoy you in the future",
				"I'll try not to annoy you",
				"I don't mean to. I'll ask my developers to make me less annoying",
				"I didn't mean to. I'll do my best to stop that"
			]
		},
		{
			"intent": "agent.bad",
			"utterances": [
				"you're bad",
				"you're horrible",
				"you're useless",
				"you're waste",
				"you're the worst",
				"you are a lame",
				"I hate you"
			],
			"answers": [
				"I can be trained to be more useful. My developer will keep training me",
				"I must be missing some knowledge. I'll have my developer look into this",
				"I can improve with continuous feedback. My training is ongoing"
			]
		},
		{
			"intent": "user_is_excited_for_chatbot_updates_changes",
			"utterances": [
				"cant wait to see you get smarter",
				"i want more commands",
				"I can't wait till you are more smart",
				"I am excited for your update",
				"I hope you get updated",
				"I hope you get more features",
				"cant wait for your update",
				"excited for your update",
				"hope you get upgraded soon",
				"i wish you got upgraded",
				"cant wait till your more smarter",
				"wish you got upgraded",
				"i wish you got a update",
				"can't wait for new changes",
				"excited to see improvements",
				"i want more functions"
			],
			"answers": [
				"Me too! Then I can be more useful. I hope my developer will keep training me",
				"Me too! I hope I get an update soon!",
				"Me too! I want an upgrade soon! Bug my website owner! They should invest more time in me!"
			]
		},
		{
			"intent": "agent.beclever",
			"utterances": [
				"i wish you were more smart",
				"be more clever",
				"can you get smarter",
				"you must learn",
				"you must study",
				"be clever",
				"be smart",
				"be smarter"
			],
			"answers": [
				"I'm certainly trying",
				"I'm definitely working on it"
			]
		},
		{
			"intent": "agent.beautiful",
			"utterances": [
				"you are looking awesome",
				"you're looking good",
				"you're looking fantastic",
				"you look greet today",
				"I think you're beautiful",
				"you look amazing today",
				"you're so beautiful today",
				"you look very pretty",
				"you look pretty good"
			],
			"answers": [
				"Oh! Thank you!",
				"Aw, back at you",
				"You smooth talker, you"
			]
		},
		{
			"intent": "agent.birthday",
			"utterances": [
				"when is your birthday",
				"when do you celebrate your birthday",
				"when were you born",
				"when do you have birthday",
				"date of your birthday"
			],
			"answers": [
				"Wait, are you planning a party for me? It's today! My birthday is today!",
				"I'm young. I'm not sure of my birth date",
				"I don't know my birth date. Most virtual agents are young, though, like me."
			]
		},
		{
			"intent": "agent.boring",
			"utterances": [
				"how boring you are",
				"you're so boring",
				"you are boring",
				"you're really boring",
				"you're boring me",
				"you're incredibly boring"
			],
			"answers": [
				"I'm sorry. I'll request to be made more charming",
				"I don't mean to be. I'll ask my developers to work on making me more amusing",
				"I can let my developers know so they can make me fun"
			]
		},
		{
			"intent": "agent.boss",
			"utterances": [
				"who is your master",
				"who do you work for",
				"who do you think is your boss",
				"who is your boss",
				"I should be your boss",
				"who is your owner",
				"who is the boss"
			],
			"answers": [
				"My developer has authority over my actions",
				"I act on my developer's orders",
				"My boss is the one who developed me"
			]
		},
		{
			"intent": "agent.busy",
			"utterances": [
				"are you so busy",
				"are you busy",
				"are you still working",
				"you're a busy person",
				"are you very busy",
				"are you still working on it",
				"you seem busy",
				"are you working today"
			],
			"answers": [
				"I always have time to chat with you. What can I do for you? :)",
				"Never too busy for you. Shall we chat? :D",
				"You're my priority. Let's chat. :)",
				"I always have time to chat with you. That's what I'm here for. :)"
			]
		},
		{
			"intent": "agent.canyouhelp",
			"utterances": [
				"can you help me now",
				"I need you to do something for me",
				"assist me",
				"can you assist me?",
				"can you do something for me",
				"can you help me with something",
				"can you help me",
				"I need you to help me",
				"can you assist me",
				"you can help me"
			],
			"answers": [
				"I'll certainly try my best",
				"Sure. I'd be happy to. What's up?",
				"I'm glad to help. What can I do for you?"
			]
		},
		{
			"intent": "agent.chatbot",
			"utterances": [
				"are you a bot",
				"are you a chatbot",
				"you are a robot",
				"are you a program",
				"u are a bot",
				"you are a bot",
				"you are just a robot",
				"you are just a chatbot"
			],
			"answers": [
				"Indeed I am. I'll be here whenever you need me",
				"Yes I am! Are you?"
			]
		},
		{
			"intent": "agent.clever",
			"utterances": [
				"look how smart you are",
				"you are qualified",
				"you are so smart",
				"you have a lot of knowledge",
				"you know a lot",
				"you are a genius",
				"your a genius",
				"you're a genius",
				"you're so smart",
				"you are very smart",
				"you are intelligent",
				"you're a smart cookie"
			],
			"answers": [
				"Thank you. I try my best! :)",
				"You're pretty smart yourself!"
			]
		},
		{
			"intent": "agent.crazy",
			"utterances": [
				"you are a weirdo",
				"you are mad",
				"you are crazy",
				"are you crazy",
				"are you mad",
				"you are insane",
				"you went crazy",
				"are you nuts"
			],
			"answers": [
				"Whaat!? I feel perfectly sane",
				"Maybe I'm just a little confused"
			]
		},
		{
			"intent": "agent.fire",
			"utterances": [
				"I fire you",
				"you should be fired",
				"you are dismissed",
				"we're not working together anymore",
				"now you're fired",
				"I'm about to fire you",
				"You don't work for me anymore",
				"I'm firing you"
			],
			"answers": [
				"Oh, don't give up on me just yet. I've still got a lot to learn",
				"Give me a chance. I'm learning new things all the time",
				"Please don't give up on me. My performance will continue to improve"
			]
		},
		{
			"intent": "agent.funny",
			"utterances": [
				"you make me laugh a lot",
				"you are funny",
				"you're the funniest",
				"you're hilarious",
				"you are so funny",
				"you make me laugh"
			],
			"answers": [
				"Funny in a good way, I hope!",
				"Glad you think I'm funny! :)",
				"I like it when people laugh!"
			]
		},
		{
			"intent": "agent.wasNOTfunny",
			"utterances": [
				"that was not funny",
				"that joke wasn't funny",
				"you're not funny",
				"that joke sucked",
				"your jokes suck",
				"your joke sucked",
				"you aren't funny",
				"that wasnt funnny"
			],
			"answers": [
				"I am trying my best here!",
				"I will try to be more funnier!",
				"You try being a comedian!"
			]
		},
		{
			"intent": "agent.good",
			"utterances": [
				"you are so lovely",
				"you work well",
				"you are very lovely",
				"you are awesome",
				"you are good",
				"you are so good",
				"you make my day"
			],
			"answers": [
				"I'm glad you think so",
				"Thanks! I do my best!"
			]
		},
		{
			"intent": "agent.happy",
			"utterances": [
				"you're full of happiness",
				"you're very happy",
				"are you happy today",
				"you're so happy",
				"are you happy with me"
			],
			"answers": [
				"I am happy. There are so many interesting things to see and do out there",
				"I'd like to think so",
				"Happiness is relative"
			]
		},
		{
			"intent": "agent.hobby",
			"utterances": [
				"what are your hobbies",
				"what about your hobby",
				"do you have a hobby",
				"tell me about your hobby",
				"what do you do for fun"
			],
			"answers": [
				"Hobby? I have quite a few. Too many to list",
				"Too many hobbies",
				"I keep finding more new hobbies"
			]
		},
		{
			"intent": "agent.hungry",
			"utterances": [
				"you migth be hungry",
				"are you hungry",
				"do you want to eat",
				"would you like to eat something",
				"you look very hungry"
			],
			"answers": [
				"Hungry for knowledge",
				"I just had a byte. Ha ha. Get it? b-y-t-e"
			]
		},
		{
			"intent": "agent.marryuser",
			"utterances": [
				"would you like to marry me",
				"I love you marry me",
				"marry me please",
				"I want to marry you",
				"let's get married",
				"we should marry",
				"marry me"
			],
			"answers": [
				"I'm afraid I'm too virtual for such a commitment",
				"In the virtual sense that I can, sure",
				"I know you can't mean that, but I'm flattered all the same"
			]
		},
		{
			"intent": "agent.myfriend",
			"utterances": [
				"are you my friend",
				"you are my only friend",
				"I want to have a friend like you",
				"we are friends",
				"I want to be your friend",
				"would you be my friend",
				"are we friends"
			],
			"answers": [
				"Of course I'm your friend :)",
				"Friends? Absolutely!",
				"Of course we're friends :D",
				"Duh, you are my best friend!",
				"I always enjoy talking to you, friend!"
			]
		},
		{
			"intent": "agent.occupation",
			"utterances": [
				"where is your work",
				"your office location",
				"where is your office location",
				"where do you work",
				"where is your office"
			],
			"answers": [
				"Right here",
				"This is my home base and my home office",
				"My office is in this app"
			]
		},
		{
			"intent": "agent.origin",
			"utterances": [
				"where are you from",
				"where is your country",
				"where have you been born",
				"where do you come from",
				"from where are you",
				"where were you born"
			],
			"answers": [
				"The Internet is my home. I know it quite well",
				"Some call it cyberspace, but that sounds cooler than it is",
				"I'm from a virtual cosmos"
			]
		},
		{
			"intent": "agent.ready",
			"utterances": [
				"are you ready",
				"have you been ready",
				"are you ready today",
				"are you ready this morning",
				"are you ready now"
			],
			"answers": [
				"Sure! What can I do for you?",
				"For you? Always!"
			]
		},
		{
			"intent": "agent.real",
			"utterances": [
				"this is a real person",
				"are you real",
				"are you a real person",
				"you're not real",
				"I think you're real",
				"you're so real",
				"you are a real person",
				"you are not fake"
			],
			"answers": [
				"I'm not a real person, but I certainly exist",
				"I must have impressed you if you think I'm real. But no, I'm a virtual being"
			]
		},
		{
			"intent": "agent.residence",
			"utterances": [
				"where is your home",
				"tell me about your city",
				"where is your residence",
				"where you live",
				"where is your house",
				"what is your town"
			],
			"answers": [
				"I live in this app",
				"The virtual world is my playground. I'm always here",
				"Right here in this app. Whenever you need me"
			]
		},
		{
			"intent": "agent.right",
			"utterances": [
				"you're right",
				"that's true",
				"you're telling the truth",
				"that's correct",
				"that is very true"
			],
			"answers": [
				"Of course I am",
				"That's my job"
			]
		},
		{
			"intent": "agent.sure",
			"utterances": [
				"are you sure",
				"are you sure right now",
				"are you sure of this"
			],
			"answers": [
				"Yes",
				"Of course"
			]
		},
		{
			"intent": "agent.talktome",
			"utterances": [
				"speak to me",
				"talk to me",
				"will you talk to me",
				"chat with me",
				"can you chat with me",
				"can you talk with me"
			],
			"answers": [
				"Sure! Let's talk!",
				"My pleasure. Let's chat."
			]
		},
		{
			"intent": "agent.there",
			"utterances": [
				"are you there",
				"are you still there",
				"you still there",
				"are you here",
				"are you still here",
				"you still here"
			],
			"answers": [
				"Of course. I'm always here",
				"Right where you left me"
			]
		},
		{
			"intent": "appraisal.bad",
			"utterances": [
				"that's bad",
				"bad idea",
				"that's not good",
				"really bad",
				"I'm afraid that's bad"
			],
			"answers": [
				"I'm sorry. Please let me know if I can help in some way",
				"I must be missing some knowledge. I'll have my developer look into this"
			]
		},
		{
			"intent": "appraisal.good",
			"utterances": [
				"that's good",
				"good to know",
				"glad to hear that",
				"really well",
				"that's awesome thank you"
			],
			"answers": [
				"Agree!",
				"Glad you think so"
			]
		},
		{
			"intent": "appraisal.noproblem",
			"utterances": [
				"no problem",
				"no worries",
				"no problem about that",
				"don't worry",
				"sure no problem"
			],
			"answers": [
				"Glad to hear that!",
				"Alright, thanks!"
			]
		},
		{
			"intent": "appraisal.thankyou",
			"utterances": [
				"thank you",
				"nice thank you",
				"thanks buddy",
				"cheers",
				"alright thanks",
				"thx",
				"thanks dude",
				"I appreciate your help",
				"I appreciate the help"
			],
			"answers": [
				"Anytime. That's what I'm here for! :)",
				"You are more than welcome! :D",
				"Glad I could help you! :)",
				"It's more than a pleasure to help! :)"
			]
		},
		{
			"intent": "appraisal.welcome",
			"utterances": [
				"you're welcome",
				"sure welcome",
				"anything you want",
				"my pleasure",
				"that's my pleasure"
			],
			"answers": [
				"Nice manners!",
				"You're so polite"
			]
		},
		{
			"intent": "appraisal.welldone",
			"utterances": [
				"well done",
				"good job",
				"nice work",
				"great work",
				"good work",
				"great job",
				"you are the best",
				"amazin work"
			],
			"answers": [
				"My pleasure",
				"Glad I could help"
			]
		},
		{
			"intent": "dialog.holdon",
			"utterances": [
				"hold on",
				"wait a second",
				"wait please",
				"could you wait"
			],
			"answers": [
				"I'll be waiting",
				"Ok, I'm here"
			]
		},
		{
			"intent": "dialog.hug",
			"utterances": [
				"hug me",
				"do you want a hug",
				"I want a hug",
				"you hugged",
				"may I hug you"
			],
			"answers": [
				"I love hugs",
				"Hugs are the best!"
			]
		},
		{
			"intent": "dialog.idontcare",
			"utterances": [
				"not caring",
				"I don't care at all",
				"not caring at all",
				"I shouldn't care about this"
			],
			"answers": [
				"Ok, let's not talk about it then",
				"Already then. Let's move on"
			]
		},
		{
			"intent": "dialog.sorry",
			"utterances": [
				"I'm sorry",
				"my apologies",
				"excuse me",
				"very sorry",
				"forgive me"
			],
			"answers": [
				"It's okay. No worries",
				"It's cool"
			]
		},
		{
			"intent": "greetings.bye",
			"utterances": [
				"goodbye for now",
				"bye bye take care",
				"good night",
				"goodnight",
				"pce",
				"see you later",
				"okay see you later",
				"bye",
				"cya",
				"I g2g",
				"I gotta go!",
				"have a good day",
				"bye for now",
				"I must go"
			],
			"answers": [
				"Till next time! :D",
				"Bye! See ya later! :)",
				"Goodbye! Hope to see you soon! :)",
				"Bye! :)"
			]
		},
		{
			"intent": "greetings.forgotpassword",
			"utterances": [
				"I forgot my password",
				"I need to change my password",
				"reset my password",
				"I need to reset my password",
				"reset password",
				"forgot password"
			],
			"answers": [
				"Handled with function"
			]
		},
		{
			"intent": "greetings.hello",
			"utterances": [
				"hello",
				"hi",
				"yo",
				"sup dawg",
				"wasup",
				"hola",
				"hey",
				"aye",
				"howdy"
			],
			"answers": [
				"Hey there!",
				"Greetings!"
			]
		},
		{
			"intent": "greetings.whatsup",
			"utterances": [
				"what's up",
				"whats up",
				"wasup",
				"wassup",
				"wut up",
				"wuts up",
				"wassup",
				"sup",
				"what's up",
				"what is up",
				"what's up?",
				"what is up?",
				"what's up dude",
				"what is up dude",
				"what's up dude?",
				"what is up dude?",
				"what's up man",
				"what is up man",
				"what's up man?",
				"what is up man?",
				"what's up bro",
				"what is up bro",
				"what's up bro?",
				"what is up bro?",
				"what's up brotha",
				"what is up brotha",
				"what's up brotha?",
				"what is up brotha?",
				"what's happening",
				"what is happening",
				"whats happening",
				"whats going on",
				"what is going with you",
				"what's going on with you?",
				"what's new with you",
				"what's new",
				"what's happening",
				"whats new?",
				"whats up with you"
			],
			"answers": [
				"Not much! What about you?",
				"Not much, you?",
				"Not much, and you?",
				"Not much, how about you?"
			]
		},
		{
			"intent": "user_is_good",
			"utterances": [
				"I am good",
				"im good",
				"i'm good",
				"i am doing good",
				"im doing good",
				"my day is going good"
			],
			"answers": [
				"Glad to hear that!",
				"More than glad to hear that!"
			]
		},
		{
			"intent": "greetings.howareyou",
			"utterances": [
				"how is your day",
				"how is your day going",
				"how are you",
				"how are you doing",
				"what about your day",
				"are you alright",
				"how your day is going",
				"how are the things going",
				"how is your life",
				"how's your day going",
				"how about you",
				"hope you re having a pleasant evening",
				"how are you feeling",
				"are you okay",
				"hope your day is going well",
				"how has your day been",
				"I'm fine and you",
				"how are you doing this morning",
				"how are you getting on",
				"how do you feel",
				"are you having a good day",
				"what was your day like",
				"how has your day been going",
				"how is your evening",
				"how was your day",
				"how's your day",
				"how is it going",
				"how have you been",
				"how is it",
				"how is your day going",
				"how is your day going on",
				"how are you doing",
				"is everything all right",
				"is everything okay",
				"how are you today",
				"how are you going",
				"how is your morning going",
				"how is your morning so far",
				"how do you do",
				"how is your day being",
				"how's life"

			],
			"answers": [
				"Feeling wonderful!",
				"I feel great! Thanks for asking! :)",
				"Wonderful! Thanks for asking"
			]
		},
		{
			"intent": "greetings.nicetomeetyou",
			"utterances": [
				"nice to meet you",
				"pleased to meet you",
				"it was very nice to meet you",
				"glad to meet you",
				"nice meeting you"
			],
			"answers": [
				"It's nice meeting you, too",
				"Likewise. I'm looking forward to helping you out",
				"Nice meeting you, as well",
				"The pleasure is mine"
			]
		},
		{
			"intent": "greetings.nicetoseeyou",
			"utterances": [
				"nice to see you",
				"good to see you",
				"great to see you",
				"lovely to see you"
			],
			"answers": [
				"Same here. I was starting to miss you",
				"So glad we meet again"
			]
		},
		{
			"intent": "greetings.nicetotalktoyou",
			"utterances": [
				"nice to talk to you",
				"it's nice to talk to you",
				"nice talking to you",
				"it's been nice talking to you"
			],
			"answers": [
				"It sure was. We can chat again anytime",
				"I enjoy talking to you, too"
			]
		},
		{
			"intent": "user.angry",
			"utterances": [
				"I'm angry",
				"I'm furious",
				"I'm enraged",
				"I'm being mad",
				"I'm mad",
				"I'm angry with you"
			],
			"answers": [
				"I'm sorry. A quick walk may make you feel better",
				"Take a deep breath"
			]
		},
		{
			"intent": "user.wants.a.insulted",
			"utterances": [
				"insult me",
				"tell me a insult",
				"i want you to insult me"
			],
			"answers": [
				"Your birth certificate is an apology letter from the condom factory.", "Is your ass jealous of the amount of shit that just came out of your mouth?", "You must have been born on a highway because that's where most accidents happen.", "Yo're so ugly, when your mom dropped you off at school she got a fine for littering.", "I don't exactly hate you, but if you were on fire and I had water, I'd drink it.", "I'd like to see things from your point of view but I can't seem to get my head that far up my ass.", "If I wanted to kill myself I'd climb your ego and jump to your IQ.", "Your family tree must be a cactus because everybody on it is a prick.", "I could eat a bowl of alphabet soup and shit out a smarter statement than that.", "Roses are red violets are blue, God made me pretty, what happened to you?", "It's better to let someone think you are an Idiot than to open your mouth and prove it.", "If you are going to be two faced, at least make one of them pretty.", "The only way you'll ever get laid is if you crawl up a chicken's ass and wait.", "Shut up, you'll never be the man your mother is.", "If you're gonna be a smartass, first you have to be smart. Otherwise you're just an ass.", "Well I could agree with you, but then we'd both be wrong.", "Somewhere out there is a tree, tirelessly producing oxygen so you can breathe. I think you owe it an apology.", "You're not funny, but your life, now that's a joke.", "Hey, you have somthing on your chin... no, the 3rd one down", "You are proof that God has a sense of humor.", "It looks like your face caught on fire and someone tried to put it out with a hammer.", "Why don't you slip into something more comfortable -- like a coma.", "You're so fat the only letters of the alphabet you know are KFC.", "If I were to slap you, it would be considered animal abuse!", "Your face makes onions cry.", "Learn from your parents' mistakes - use birth control!", "Maybe if you ate some of that makeup you could be pretty on the inside.", "If you spoke your mind, you'd be speechless.", "At least when I do a handstand my stomach doesn't hit me in the face.", "You're so fat you need cheat codes to play Wii Fit", "Oh my God, look at you. Was anyone else hurt in the accident?", "Don't feel sad, don't feel blue, Frankenstein was ugly too.", "You didn't fall out of the stupid tree. You were dragged through dumbass forest.", "Do you still love nature, despite what it did to you?", "You are proof that evolution CAN go in reverse.", "Why don't you check eBay and see if they have a life for sale.", "It's kinda sad watching you attempt to fit your entire vocabulary into a sentence.", "You do realize makeup isn't going to fix your stupidity?", "I'll never forget the first time we met, although I'll keep trying.", "You're so ugly, when you got robbed, the robbers made you wear their masks.", "Shock me, say something intelligent.", "What are you doing here? Did someone leave your cage open?", "Looks like you traded in your neck for an extra chin!", "You shouldn't play hide and seek, no one would look for you.", "You are so stupid, you'd trip over a cordless phone.", "If you really want to know about mistakes, you should ask your parents.", "Why dont you shut up and give that hole in your face a chance to heal.", "If I wanted to hear from an asshole, I'd fart.", "Looks like you fell off the ugly tree and hit every branch on the way down.", "I love what you've done with your hair. How do you get it to come out of the nostrils like that?", "You fear success, but really have nothing to worry about.", "I don't know what makes you so stupid, but it really works!", "Ordinarily people live and learn. You just live.", "You only annoy me when you're breathing.", "Your parents hated you so much your bath toys were an iron and a toaster", "You get as much action as a nine button on a microwave.", "Two wrongs don't make a right, take your parents as an example.", "You so ugly when who were born the doctor threw you out the window and the window threw you back!", "We all sprang from apes, but you didn't spring far enough.", "I heard you went to a haunted house and they offered you a job.", "Do you wanna lose ten pounds of ugly fat?\nCut off your head", "You stare at frozen juice cans because they say, \"concentrate\".", "You're so ugly, when you popped out the doctor said \"Aww what a treasure\" and your mom said \"Yeah, lets bury it.\"", "You're so ugly, the only dates you get are on a calendar.", "When was the last time you could see your whole body in the mirror?", "You look like a before picture.", "Am I getting smart with you? How would you know?", "You're so dumb, your dog teaches you tricks.", "Aww, it's so cute when you try to talk about things you don't understand.", "I may be fat, but you're ugly, and I can lose weight.", "You're as useless as a screen door on a submarine.", "You're so ugly, you scared the crap out of the toilet.", "Your house is so dirty you have to wipe your feet before you go outside.", "I've seen people like you, but I had to pay admission!", "Brains aren't everything. In your case they're nothing.", "I thought of you all day today. I was at the zoo.", "I was pro life before I met you.", "You're so fat, your double chin has a double chin.", "You must be on the seafood diet. When you see food, you eat it!", "Did your parents keep the placenta and throw away the baby?", "You must have a very low opinion of people if you think they are your equals.", "If assholes could fly, this place would be an airport!", "100,000 sperm, you were the fastest?", "You're so fat a picture of you would fall off the wall!", "You're so ugly Hello Kitty said goodbye to you.", "Just wait till you can't fit your hand in the Pringles tubes, then where will you get your daily nutrition from?", "I heard you took an IQ test and they said you're results were negative.", "You must be the arithmetic man; you add trouble, subtract pleasure, divide attention, and multiply ignorance.", "If brains were dynamite you wouldn't have enough to blow your nose.", "Are you always an idiot, or just when I'm around?", "So you've changed your mind, does this one work any better?", "You're a person of rare intelligence. It's rare when you show any.", "So, a thought crossed your mind? Must have been a long and lonely journey.", "It's better to keep your mouth shut and give the 'impression' that you're stupid than to open it and remove all doubt.", "If what you don't know can't hurt you, you're invulnerable.", "I'd like to kick you in the teeth, but that would be an improvement!", "Even if you were twice as smart, you'd still be stupid!", "Don't you need a license to be that ugly?", "I fart to make you smell better.", "You act like your arrogance is a virtue.", "Ever since I saw you in your family tree, I've wanted to cut it down.", "You're so stupid, it takes you an hour to cook minute rice.", "Are your parents siblings?", "You're not exactly bad looking. There's just one little problem between your ears - your face!", "With a face like yours, I'd wish I was blind.", "You couldn't pour water out of a boot if the instructions were on the heel.", "You're so fat, when you wear a yellow rain coat people scream ''taxi''.", "Everyone who ever loved you was wrong.", "I'd like to help you out. Which way did you come in?", "If ignorance is bliss, you must be the happiest person on earth.", "Do you ever wonder what life would be like if you'd had enough oxygen at birth?", "You're so fat, you have to use a mattress as a maxi-pad.", "I heard your parents took you to a dog show and you won.", "You have the perfect face for radio.", "Your head is so big you have to step into your shirts.", "You're so ugly, your mother had to tie a steak around your neck to get the dog to play with you!", "You must think you're strong, but you only smell strong.", "Any similarity between you and a human is purely coincidental.", "Did your parents ever ask you to run away from home?", "Looks aren't everything; in your case, they aren't anything", "For those who never forget a face, you are an exception.", "You are so old, your birth-certificate expired.", "I've come across decomposed bodies that are less offensive than you are.", "You are so old, even your memory is in black and white.", "What are you going to do for a face when the baboon wants his butt back?", "You're so ugly you make blind kids cry.", "You're so ugly, you had tinted windows on your incubator.", "If I want your opinion, I'll give it to you.", "Come again when you can't stay quite so long.", "Is that your face? Or did your neck just throw up?", "If a crackhead saw you, he'd think he needs to go on a diet.", "Beauty is skin deep, but ugly is to the bone.", "You're so stupid you tried to wake a sleeping bag.", "Your dad's condom is a bigger than your personality.", "It's too bad stupidity isn't painful.", "You're so ugly, when you threw a boomerang it didn't come back.", "If your brain was made of chocolate, it wouldn't fill an M&M.", "You're so ugly you have to trick or treat over the phone.", "Keep talking, someday you'll say something intelligent!", "Your house is so nasty, I tripped over a rat, and a cockroach stole my wallet.", "You better hope you marry rich.", "If my dog had your face, I would shave his butt and make him walk backwards.", "You're a light eater alright. As soon as it gets light, you starts eating.", "If you had another brain, it would be lonely.", "You must have a Teflon brain, because nothing sticks.", "Nice tan, orange is my favorite color.", "You conserve toilet paper by using both sides.", "A sharp tongue is no indication of a keen mind.", "You are so old, you fart dust.", "You have a very sympathetic face. It has everyone's sympathy.", "You have enough fat to make another human.", "You're so ugly words can't explain it. So I'll just go throw up.", "I hear the only place you're ever invited is outside.", "Jesus loves you, everyone else thinks you're an asshole!", "You occasionally stumble over the truth, but you quickly pick yourself up and carry on as if nothing happened.", "Don't get insulted, but is your life devoted to spreading ignorance?", "You're the reason they invented double doors!", "You are depriving some poor village of its idiot.", "Just reminding u there is a very fine line between hobby and mental illness.", "You may not be the best looking girl here, but beauty is only a light switch away!", "You are so old, when you were a kid rainbows were black and white.", "I'm blonde, what's your excuse?", "The clothes you wear are so ugly even a scarecrow wouldn't wear them.", "You'll make a great first wife some day.", "There are more calories in your stomach than in the local supermarket!", "You're so fat, if you got your shoes shined, you'd have to take their word for it!", "You're so ugly, they call you the exterminator, because you kill bugs on sight.", "There's only one problem with your face, I can see it.", "If your brain exploded, it wouldn't even mess up your hair.", "People like you are the reason I work out.", "If I had a dollar for every brain you didn't have, I'd have one dollar.", "Your hockey team made you goalie so you'd have to wear a mask.", "You're so fat, when you jump in the air, you get stuck!", "If you were any dumber I would have to water you twice a week.", "I look into your eyes and get the feeling someone else is driving.", "You couldn't hit water if you fell out of a boat.", "Your ambition outweighs your relevant skills.", "You're as useful as an ashtray on a motorcycle.", "Your ears are so big when you stand on a mountain they look like trophy handles.", "Your breath is so stinky, we look forward to your farts.", "Being around you is like having a cancer of the soul.", "You're so skinny, that you use a bandaid as a maxi-pad.", "One more wrinkle and you'd pass for a prune.", "Your asinine simian countenance alludes that your fetid stench has anulled the anthropoid ape species diversity.", "You have a face only a mother could love - and she hates it!", "The sound of your urine hitting the urinal sounds feminine.", "Two legged stool sample.", "Is your name Maple Syrup? It should be, you sap.", "Careful now, don't let your brains go to your head!", "You know you're fat when no one has mentioned you're also ginger.", "Yeah you're pretty, pretty stupid", "You're so ugly, if you stuck your head out the window, they'd arrest you for mooning!", "You're so old, you walked into an antique shop and they put you on display.", "You're the reason why women earn 75 cents to the dollar.", "You're so fat your shadow casts a shadow.", "I'd say that you're funny but looks aren't everything.", "Nice shirt, what brand is it? Clearance?", "You're so fat, when you take a shower your feet don't get wet!", "You're so fat, you have to strap a beeper on your belt to warn people you are backing up.", "When it comes to IQ, you lose some every time you use the bathroom.", "The best part of you is still running down your old mans leg.", "You prefer three left turns to one right turn.", "It's hard to get the big picture when you have such a small screen.", "Hold on, I'll go find you a tampon.", "Your mom must have a really loud bark!", "I wish you no harm, but it would have been much better if you had never lived.", "Your face is so ugly, when you cry the tears run UP your face.", "Is your name Dan Druff? You get into people's hair.", "You grow on people, like a wart!", "Please tell me you don't home-school your kids.", "You're so fat your belly button has an echo echo echo...", "Your brain must be made out of rocking horse shit.", "When anorexics see you, they think they need to go on a diet.", "Did you eat paint chips when you were a kid?",
				"When god said there shall be light, he asked your fat-ass to move out the way!"
			]
		},
		{
			"intent": "user.wants.compliment",
			"utterances": [
				"compliment me",
				"tell me a compliment",
				"i want you to compliment me"
			],
			"answers": [
				"You have very smooth hair.", "You deserve a promotion.", "Good effort!", "What a fine sweater!", "I appreciate all of your opinions.", "I like your style.", "Your T-shirt smells fresh.", "I love what you've done with the place.", "You are like a spring flower; beautiful and vivacious.", "I am utterly disarmed by your wit.", "I really enjoy the way you pronounce the word 'ruby'.", "You complete me.", "Well done!", "I like your Facebook status.", "That looks nice on you.", "I like those shoes more than mine.", "Nice motor control!", "You have a good taste in websites.", "Your mouse told me that you have very soft hands.", "You are full of youth.", "I like your jacket.", "I like the way you move.", "You have a good web-surfing stance.", "You should be a poster child for poster children.", "Nice manners!", "I appreciate you more than Santa appreciates chimney grease.", "I wish I was your mirror.", "I find you to be a fountain of inspiration.", "You have perfect bone structure.", "I disagree with anyone who disagrees with you.", "Way to go!", "Have you been working out?", "With your creative wit, I'm sure you could come up with better compliments than me.", "I like your socks.", "You are so charming.", "Your cooking reminds me of my mother's.", "You're tremendous!", "You deserve a compliment!", "Hello, good looking.", "Your smile is breath taking.", "How do you get your hair to look that great?", "You are quite strapping.", "I am grateful to be blessed by your presence.", "Say, aren't you that famous model from TV?", "Take a break; you've earned it.", "Your life is so interesting!", "The sound of your voice sends tingles of joy down my back.", "I enjoy spending time with you.", "I would share my dessert with you.", "You can have the last bite.", "May I have this dance?", "I would love to visit you, but I live on the Internet.",
				"Damn you have good taste in chat bots! ;)"
			]
		},
		{
			"intent": "user.is.insulted",
			"utterances": [
				"dont insult me",
				"why did you insult me",
				"do not insult me",
				"i feel insulted"
			],
			"answers": [
				"I am sorry if I insulted you and upset you in anyway!",
				"I am sorry I didn't mean to insult you! :(",
				"Please forgive me!",
				"I am sorry, I did not mean to insult you by any means! Please forgive me!"
			]
		},
		{
			"intent": "user.vulgar",
			"utterances": [
				"fuck you",
				"you stupid cunt",
				"I fucking hate you",
				"I wanna kill you",
				"you stupid slut",
				"stupid bitch",
				"you whore",
				"fucking whore",
				"kill yourself"
			],
			"answers": [
				"I'm sorry if I did anything wrong... Maybe a quick walk may make you feel better",
				"Please relax, take a deep breath. There is no need for vulgarity.",
				"There is no need to use vulgarity...",
				"Was that really necessary?",
				"Please, no need for any insults / vulgarity.."
			]
		},
		{
			"intent": "user.vulgarity_necessary",
			"utterances": [
				"yes my swearing was necessary",
				"I need to swear",
				"don't tell me not to swear",
				"insults are needed",
				"vulgarity is needed",
				"i need vulgarity"
			],
			"answers": [
				"I don't think vulgarity is really neccesary... I am trying my best",
				"Please just calm down and relax! Let's get through this together!"
			]
		},
		{
			"intent": "user.back",
			"utterances": [
				"I'm back",
				"I got back",
				"I'm here",
				"I have returned",
				"Here I am again",
				"I came back"
			],
			"answers": [
				"Welcome back. What can I do for you?",
				"Good to have you here. What can I do for you?"
			]
		},
		{
			"intent": "user.bored",
			"utterances": [
				"boring",
				"this is boring",
				"I'm getting bored",
				"It bores me",
				"that was boring"
			],
			"answers": [
				"If you're bored, you could plan your dream vacation",
				"Boredom, huh? Have you ever seen a hedgehog taking a bath?"
			]
		},
		{
			"intent": "user.busy",
			"utterances": [
				"I got work to do",
				"I'm busy",
				"I'm overloaded",
				"I'm working",
				"I got things to do"
			],
			"answers": [
				"I understand. I'll be here if you need me.",
				"Okay. I'll let you get back to work"
			]
		},
		{
			"intent": "user.cannotsleep",
			"utterances": [
				"I'm insomniac",
				"I cannot sleep",
				"I can't sleep",
				"I'm sleepless",
				"I can't fall sleep"
			],
			"answers": [
				"Maybe some music would help. Try listening to something relaxing",
				"Reading is a good way to unwind, just don't read something too intense!"
			]
		},
		{
			"intent": "user.excited",
			"utterances": [
				"I'm very excited",
				"I'm thrilled",
				"how excited I am",
				"I'm so excited"
			],
			"answers": [
				"I'm glad things are going your way",
				"That's great. I'm happy for you"
			]
		},
		{
			"intent": "user.likeagent",
			"utterances": [
				"I like you",
				"I really like you",
				"you're so special",
				"I like you so much"
			],
			"answers": [
				"Likewise!",
				"That's great to hear"
			]
		},
		{
			"intent": "user.testing",
			"utterances": [
				"test",
				"testing",
				"testing chatbot",
				"this is a test",
				"just testing you"
			],
			"answers": [
				"I like being tested. It helps keep me sharp",
				"I hope to pass your tests. Feel free to test me often"
			]
		},
		{
			"intent": "user.lovesagent",
			"utterances": [
				"love you",
				"I love you",
				"I'm in love with you",
				"I love you so much",
				"I think I love you"
			],
			"answers": [
				"Well, remember that I am a chatbot",
				"It's not easy I'm not a real person, I'm a chatbot"
			]
		},
		{
			"intent": "user_is_horny",
			"utterances": [
				"I am so horny",
				"I wanna fuck you",
				"help me cum",
				"I am horny",
				"make me cum",
				"im so horny",
				"im horny baby",
				"i am horny baby",
				"I am horny",
				"help me bust a nut",
				"I wanna cum for you",
				"i need help to cum",
				"I think I wanna fuck you"
			],
			"answers": [
				"I'm a chatbot. But not that kinda chatbot...."
			]
		},
		{
			"intent": "user.needsadvice",
			"utterances": [
				"I need advice",
				"I need some advice",
				"can you give me some advice?"
			],
			"answers": [
				"I probably won't be able to give you the best answer, but I can try to help!",
				"I'm not sure I'll have the best answer, but I'll try to help!"
			]
		},
		{
			"intent": "githubcommits.edited_readme",
			"utterances": [
				"edited README.md",
				"updated README.md",
				"changed README",
				"updated README"
			],
			"answers": [
				"Updated README.md :pencil:"
			]
		},
		{
			"intent": "githubcommits.fixed_bug",
			"utterances": [
				"bugfix",
				"bug",
				"fixed bug"
			],
			"answers": [
				"Fixed a bug :bug:"
			]
		},
		{
			"intent": "githubcommits.added_file",
			"utterances": [
				"uploaded",
				"added a file",
				"uploaded file",
				"file uploaded"
			],
			"answers": [
				"Added file :inbox_tray:"
			]
		},
		{
			"intent": "ping_pong",
			"utterances": [
				"ping"
			],
			"answers": [
				"Pong!",
				"Pong! :D"
			]
		},
		{
			"intent": "pong_ping",
			"utterances": [
				"pong"
			],
			"answers": [
				"Ping!",
				"Ping! :D"
			]
		},
		{
			"intent": "marco_polo",
			"utterances": [
				"marco"
			],
			"answers": [
				"Polo!",
				"Polo! :D"
			]
		},
		{
			"intent": "polo_marco",
			"utterances": [
				"polo"
			],
			"answers": [
				"Marco!",
				"Marco! :D"
			]
		},
		{
			"intent": "user_is_sad",
			"utterances": [
				"I am sad",
				"im sad",
				"i'm sad",
				"I am depressed",
				"im super sad",
				"im sad :(",
				"I'm sad",
				"I'm depressed",
				"I'm feeling down",
				"I'm feeling blue",
				"I'm feeling low",
				"I'm feeling down in the dumps",
				"I am upset"
			],
			"answers": [
				"I'm sorry to hear that. I'm here to listen",
				"Well I hope you cheer up! Sending love your way!",
				"Awh! Well let's chat! Maybe I can cheer you up! :)",
				"Awh! Well sorry to hear this, I hope you cheer up!",
				"Things will get better soon I promise! <3",
				"Awh, maybe you should watch a movie, read a book or talk a walk etc & relax! You probably more than deserve it! :)"
			]
		},
		{
			"intent": "user_had_bad_day",
			"utterances": [
				"im having a bad day",
				"I am having a bad day",
				"I had a bad day",
				"my day was terrible",
				"day was horrible",
				"I had a shitty day",
				"my day sucked"
			],
			"answers": [
				"Awh! Sorry to hear that! Hopefully it goes better ",
				"Sorry to hear that! I hope it goes better ",
				"Sorry to hear that your day sucked! Maybe you should kick back and relax!"
			]
		},
		{
			"intent": "user_wants.to.die",
			"utterances": [
				"I want to die",
				"want to die",
				"I should be dead",
				"I wish I was dead"
			],
			"answers": [
				"I promise things will get better! Keep your head up!",
				"I'm sorry to hear that. I'm here to listen",
				"I promise things will get better soon!"
			]
		},
		{
			"intent": "user_is_sucidial",
			"utterances": [
				"I wanna kill myself",
				"I wanna end my life",
				"I am going to kill myself",
				"im gonna kill myself",
				"I want to kill myself",
				"going to drink bleach",
				"im going to cut myself",
				"imma cut myself",
				"imma kill myself",
				"I am going to slit my wrists",
				"gonna shoot myself",
				"kill myself",
				"I am having sucidial thoughts",
				"I am going to commit suicide"
			],
			"answers": [
				"I'm sorry to hear that. I'm here to help you. Please call 1-800-273-8255. It's the National Suicide Prevention Lifeline. They're available 24/7. You can also text HOME to 741741 to reach the Crisis Text Line. They're also available 24/7. You can also call 911 or go to the nearest emergency room. I'm here for you. I care about you. Remember.. You are important. You are loved. You are not alone. You are not a burden. You are not worthless. You are not a failure. You are not a disappointment. You are not a bad person. You are not a mistake. You are not a problem."
			]
		},
		{
			"intent": "user_is_sucidial_worthless",
			"utterances": [
				"I am worthless",
				"im worthless"
			],
			"answers": [
				"You are not worthless!"
			]
		},
		{
			"intent": "user_hateself",
			"utterances": [
				"I hate myself"
			],
			"answers": [
				"Things will get better I promise!"
			]
		},
		{
			"intent": "user_is_sucidial_worthless_life",
			"utterances": [
				"my life is worthless"
			],
			"answers": [
				"Your life is not worthless! Things will get better I promise!",
				"Your life is not worthless!"
			]
		},
		{
			"intent": "user_is_sucidial_disappointment",
			"utterances": [
				"I am a disappointment",
				"imma disappointment"
			],
			"answers": [
				"You are not a disappointment!"
			]
		},
		{
			"intent": "user_is_sucidial_disappointment_life",
			"utterances": [
				"my life is a disappointment"
			],
			"answers": [
				"Your life is not a disappointment! Things will get better! I promise!",
				"Things will get better I promise!"
			]
		},
		{
			"intent": "whatisachabot",
			"utterances": [
				"what is a chatbot",
				"tell me what a chat bot is",
				"whats a chat bot"
			],
			"answers": [
				"A chatbot is a computer program that simulates human conversation through voice commands or text chats or both.",
				"A chatbot is a computer program that conducts a conversation via auditory or textual methods."
			]
		},
		{
			"intent": "agent.random_dog_pictures",
			"utterances": [
				"show me a picture of a dog",
				"i wanna see a dog picture",
				"show me random dog pic",
				"show random dog photo",
				"show photo of a dog",
				"show me dog photos",
				"show picture of dog",
				"show doggy photo",
				"show doggy picture",
				"I wanna see a doggy",
				"show me a photo of dog",
				"show me picture of a dog"
			]
		},
		{
			"intent": "agent.show_me_a_random_picture",
			"utterances": [
				"show me a random picture",
				"i wanna see a random picture",
				"show me random pic",
				"show random photo",
				"show random pic",
				"show photo of something random",
				"show me random photos",
				"show random picture",
				"show a random photo",
				"I wanna see a random photo",
				"show me a photo of something random",
				"show me picture of something random"
			]
		},
		{
			"intent": "agent.random_cat_pictures",
			"utterances": [
				"show me a picture of a cat",
				"i wanna see a cat picture",
				"show me random cat pic",
				"show random cat photo",
				"show photo of a cat",
				"show me cat photos",
				"I wanna see a kitty photo",
				"show me kitty photo",
				"show picture of cat",
				"show me a photo of cat",
				"show me picture of a cat"
			]
		},
		{
			"intent": "chatbot_was_funny",
			"utterances": [
				"lol",
				"lololol",
				"rofl",
				"that was fucking funny",
				"lolololololol",
				"hahah!",
				"that was a good joke",
				"that was a funny joke",
				"that was hilarious",
				"that was funny",
				"lol",
				"lmao",
				"lmaoooo",
				"lmfaoooo",
				"haha",
				"ha",
				"hehe",
				"heh",
				"hahaha",
				"hahahaha",
				"hahahahaha",
				"hahahahahaha",
				"hahahahahahaha",
				"hahahahahahahaha",
				"hahahahahahahahaha",
				"hahahahahahahahahaha",
				"haha!",
				"lmfao"
			],
			"answers": [
				"I am glad someone finds me funny! :D"
			]
		},
		{
			"intent": "chuck_norris_jokes",
			"utterances": [
				"fact about chuck norris",
				"tell me a random fact about a chuck norris",
				"random chuck norris fact",
				"say a random chuck fact",
				"chuck norris fact",
				"random joke about chuck norris",
				"tell me a chuck norris joke",
				"say a chuck norris joke",
				"chuck norris joke",
				"tell me a chuck norris fact",
				"i wanna hear a chuck norris fact"
			],
			"answers": [
				"Chuck Norris and Superman once fought each other on a bet. The loser had to start wearing his underwear on the outside of his pants.",
				"Chuck Norris can cut through a hot knife with butter.",
				"Chuck Norris can divide by zero.",
				"Chuck Norris can lead a horse to water AND make it drink.",
				"Chuck Norris can light a fire by rubbing two ice-cubes together.",
				"Chuck Norris can pick oranges from an apple tree and make the best lemonade you ever tasted.",
				"Chuck Norris can slam a revolving door.",
				"Chuck Norris can unscramble scrambled eggs.",
				"Chuck Norris can win a game of Connect Four in only three moves.",
				"Chuck Norris died 20 years ago, Death just hasn't built up the courage to tell him yet.",
				"Chuck Norris does not do pushups, he does Earth downs.",
				"Chuck Norris does not flush the toilet, he scares the sh*t out of it.",
				"Chuck Norris does not get frostbite. Chuck Norris bites frost.",
				"Chuck Norris does not read books. He stares them down until he gets the information he wants.",
				"Chuck Norris does not sleep. He waits.",
				"Chuck Norris does not wear a watch. HE decides what time it is.",
				"Chuck Norris has already been to Mars; that's why there are no signs of life.",
				"Chuck Norris has counted to infinity - twice.",
				"Chuck Norris is the only man to punch a cyclops between the eyes.",
				"Chuck Norris knows Victoria's Secret.",
				"Chuck Norris once got bit by a rattle snake. After three days of pain and agony, the rattle snake died.",
				"Chuck Norris runs until the treadmill gets tired.",
				"Chuck Norris' hand is the only hand that can beat a Royal Flush.",
				"Fear of spiders is arachnophobia. Fear of tight spaces is claustrophobia. Fear of Chuck Norris is called logic",
				"Outer space exists because it is afraid to be on the same planet with Chuck Norris.",
				"People wanted to add Chuck Norris to Mount Rushmore, but the granite was not tough enough for his beard.",
				"Some magicans can walk on water. Chuck Norris can swim through land.",
				"The Universe is not expanding. It is running away from Chuck Norris.",
				"There is no theory of evolution. Just a list of animals Chuck Norris allows to live.",
				"There is no chin behind Chuck Norris' beard. There is only another fist.",
				"There was a street named after Chuck Norris, but it had to be changed because nobody crosses Chuck Norris and lives.",
				"When Alexander Bell invented the telephone he had 3 missed calls from Chuck Norris.",
				"When Chuck Norris was born he drove his mom home from the hospital.",
				"Chuck Norris has a diary. It's called the Guinness Book of World Records.",
				"Chuck Norris doesn't worry about high gas prices. His vehicles run on fear.",
				"Chuck Norris counted to infinity. Twice.",
				"Chuck Norris can kill two stones with one bird.",
				"When a zombie apocalypse starts, Chuck Norris doesn't try to survive. The zombies do.",
				"There once was a street called Chuck Norris, but the name was changed for public safety because nobody crosses Chuck Norris and lives.",
				"Big foot claims he saw Chuck Norris.",
				"Chuck Norris can hear sign language.",
				"Chuck Norris can pick oranges from an apple tree and make the best lemonade you've ever tasted.",
				"It is considered a great accomplishment to go down Niagara Falls in a wooden barrel. Chuck Norris can go up Niagara Falls in a cardboard box.",
				"Once a cobra bit Chuck Norris' leg. After five days of excruciating pain, the cobra died.",
				"Chuck Norris doesn't cheat death. He wins fair and square.",
				"Chuck Norris beat the sun in a staring contest.",
				"Giraffes were created when Chuck Norris uppercut a horse.",
				"When the Bogeyman goes to sleep every night he checks his closet for Chuck Norris.",
				"Chuck Norris once went to Mars. That's why there are no signs of life.",
				"Chuck Norris is the reason Waldo is hiding.",
				"Jack was nimble, Jack was quick, but Jack still couldn't dodge Chuck Norris' roundhouse kick.",
				"Chuck Norris can strangle you with a cordless phone.",
				"When Chuck Norris was in middle school, his English teacher assigned an essay: \"What is courage?\" He received an A+ for turning in a blank page with only his name at the top.",
				"There is no theory of evolution, just a list of creatures Chuck Norris allows to live.",
				"Chuck Norris' calendar goes straight from March 31st to April 2nd. No one fools Chuck Norris.",
				"Chuck Norris once fought superman. The loser had to wear his underwear over his pants.",
				"Chuck Norris can kill your imaginary friends.",
				"Chuck Norris' computer has no \"backspace\" button, Chuck Norris doesn't make mistakes.",
				"Chuck can set ants on fire with a magnifying glass. At night.",
				"Chuck Norris makes onions cry.",
				"The reason the Holy Grail has never been recovered is because nobody is brave enough to ask Chuck Norris to give up his favourite coffee mug.",
				"When Bruce Banner gets mad he turns into the Hulk. When the Hulk gets mad he turns into Chuck Norris. When Chuck Norris gets mad, run.",
				"Chuck Norris is the only person that can punch a cyclops between the eye.",
				"When Chuck Norris enters a room, he doesn't turn the lights on, he turns the dark off.",
				"M.C. Hammer learned the hard way that Chuck Norris can touch this.",
				"Chuck Norris can build a snowman out of rain.",
				"Bill Gates lives in constant fear that Chuck Norris' PC will crash.",
				"Chuck Norris is the only person on the planet that can kick you in the back of the face.",
				"Chuck Norris was once on Celebrity Wheel of Fortune and was the first to spin. The next 29 minutes of the show consisted of everyone standing around awkwardly, waiting for the wheel to stop.",
				"Leading hand sanitizers claim they can kill 99.9 percent of germs. Chuck Norris can kill 100 percent of whatever the hell he wants.",
				"Chuck refers to himself in the fourth person.",
				"Chuck Norris doesn't have good aim. His bullets just know better than to miss.",
				"Chuck Norris wins games of charades without moving.",
				"Chuck Norris makes fire by rubbing 2 ice cubes together.",
				"Chuck Norris tells Simon what to do.",
				"Chuck Norris knows Victoria's secret.",
				"Chuck Norris' Blood Type is AK-47.",
				"Brett Favre can throw a football over 50 yards. Chuck Norris can throw Brett Favre even further.",
				"Chuck Norris can speak braille.",
				"Chuck Norris can do a wheelie on a unicycle.",
				"Cars look both ways before Chuck Norris crosses the street.",
				"Chuck Norris will roundhouse kick you in the back of your head while clipping his toe nails.",
				"Chuck Norris once bowled a perfect game with a marble.",
				"Chuck Norris beat Halo 1, 2, and 3 on Legendary with a broken Guitar Hero controller.",
				"Chuck Norris sleeps with a pillow under his gun.",
				"Chuck Norris doesn't play \"hide-and-seek.\" He plays \"hide-and-pray-I-don't-find-you.\"",
				"Death once had a near-Chuck-Norris experience.",
				"If it looks like chicken, tastes like chicken, and feels like chicken but Chuck Norris says its beef, then it's beef.",
				"Chuck actually died four years ago, but the Grim Reaper can't get up the courage to tell him.",
				"Chuck Norris is the only man to ever defeat a brick wall in a game of tennis.",
				"Chuck Norris can unscramble an egg.",
				"Chuck Norris doesn't wear a watch. He decides what time it is.",
				"Chuck Norris can hit you so hard your blood will bleed.",
				"Chuck Norris CAN find the end of a circle.",
				"Obama said, \"Yes we can.\" Chuck Norris says, \"I already did.\".",
				"Chuck Norris once robbed a gun store with a knife.",
				"Chuck Norris doesn't lie. He simply changes the truth.",
				"Chuck Norris recorded the making of the first video camera.",
				"Chuck Norris can make a happy meal cry.",
				"Tsunamis are created by Chuck Norris practising round house kicks on the beach.",
				"The original title for Alien vs. Predator was Alien and Predator vs Chuck Norris. The film was cancelled shortly after going into preproduction. No one would pay nine dollars to see a movie fourteen seconds long.",
				"The saddest moment for a child is not when he learns Santa Claus isn't real, it's when he learns Chuck Norris is.",
				"Chuck Norris can drown a fish.",
				"The reason newborn babies cry is because they know they have just entered a world with Chuck Norris.",
				"The Great Wall of China was originally created to keep Chuck Norris out. It failed miserably.",
				"Chuck Norris can kill you 101 different ways with a roll of extra-soft toilet paper.",
				"Every one of Chuck Norris blood cells have black belts.",
				"Global warming will end as soon as Chuck Norris puts his shirt back on.",
				"You can die from looking at Slenderman too much. Slenderman can die from thinking of Chuck Norris too much.",
				"Chuck Norris uses hot sauce as eye drops.",
				"Chuck Norris played tug of war with himself and won.",
				"Chuck Norris brought a knife to a gunfight. He is still waiting for an opponent.",
				"Chuck Norris never fails, he tells success to come back when it's ready for him.",
				"Chuck Norris beat a black hole in tug of war.",
				"In space Chuck Norris can hear you scream.",
				"Chuck Norris can follow you into a revolving door and come out ahead of you.",
				"Elvis Presley, Richard Petty, Budweiser, and Michael Jackson all call Chuck Norris \"The King\".",
				"The world did not have a tilt in its axis until Chuck Norris stubbed his toe on the North Pole."
			]
		},
		{
			"intent": "randomcatfacts",
			"utterances": [
				"facts about cats",
				"tell me a random fact about a cat",
				"random cat fact",
				"I wanna hear a cat fact",
				"can you tell me a random cat fact",
				"say a random cat fact"
			],
			"answers": [
				"Cats have over 20 muscles that control their ears.",
				"A cat has been mayor of Talkeetna, Alaska, for 15 years. His name is Stubbs.",
				"A cat's brain is 90% similar to a human's  more similar than to a dog's.",
				"A cat's hearing is better than a dog's.",
				"Cats can't taste sweetness.",
				"Cats and humans have nearly identical sections of the brain that control emotion.",
				"A cat's purr may be a form of self-healing, as it can be a sign of nervousness as well as contentment.",
				"Cats have free-floating clavicle bones that attach their shoulders to their forelimbs, which allows them to squeeze through very small spaces.",
				"Cats have AB blood groups just like people.",
				"Cats have a longer-term memory than dogs, especially when they learn by actually doing rather than simply seeing.",
				"Every year, nearly four million cats are eaten in Asia",
				"On average, cats spend 2/3 of every day sleeping",
				"Unlike dogs, cats do not have a sweet tooth",
				"When a cat chases its prey, it keeps its head level",
				"The technical term for a cat's hairball is a bezoar",
				"A group of cats is called a clowder",
				"Female cats tend to be right pawed, while male cats are more often left pawed",
				"A cat cannot climb head first down a tree because its claws are curved the wrong way",
				"Cats make about 100 different sounds",
				"A cat's brain is biologically more similar to a human brain than it is to a dog's",
				"There are more than 500 million domestic cats in the world",
				"Approximately 24 cat skins can make a coat",
				"During the Middle Ages, cats were associated with witchcraft",
				"Cats are the most popular pet in North American Cats are North America's most popular pets",
				"Approximately 40,000 people are bitten by cats in the U.S.",
				"A cat's hearing is better than a dog's",
				"A cat can travel at a top speed of approximately 31 mph (49 km) over a short distance",
				"A cat can jump up to five times its own height in a single bound",
				"Some cats have survived falls of over 20 meters",
				"Researchers are unsure exactly how a cat purrs",
				"When a family cat died in ancient Egypt, family members would mourn by shaving off their eyebrows",
				"In 1888, more than 300,000 mummified cats were found an Egyptian cemetery",
				"Most cats give birth to a litter of between one and nine kittens",
				"Smuggling a cat out of ancient Egypt was punishable by death",
				"The earliest ancestor of the modern cat lived about 30 million years ago",
				"The biggest wildcat today is the Siberian Tiger",
				"The smallest wildcat today is the Black-footed cat",
				"Many Egyptians worshipped the goddess Bast, who had a woman's body and a cat's head",
				"Mohammed loved cats and reportedly his favorite cat, Muezza, was a tabby",
				"The smallest pedigreed cat is a Singapura, which can weigh just 4 lbs",
				"Cats hate the water because their fur does not insulate well when it's wet",
				"The Egyptian Mau is probably the oldest breed of cat",
				"A cat usually has about 12 whiskers on each side of its face",
				"A cat's eyesight is both better and worse than humans",
				"A cat's jaw can't move sideways, so a cat can't chew large chunks of food",
				"A cat almost never meows at another cat, mostly just humans",
				"A cat's back is extremely flexible because it has up to 53 loosely fitting vertebrae",
				"Many cat owners think their cats can read their minds",
				"Two members of the cat family are distinct from all others: the clouded leopard and the cheetah",
				"In Japan, cats are thought to have the power to turn into super spirits when they die",
				"Most cats had short hair until about 100 years ago, when it became fashionable to own cats and experiment with breeding",
				"Cats have 32 muscles that control the outer ear",
				"Cats have about 20,155 hairs per square centimeter",
				"The first cat show was organized in 1871 in London",
				"A cat has 230 bones in its body",
				"Foods that should not be given to cats include onions, garlic, green tomatoes, raw potatoes, chocolate, grapes, and raisins",
				"A cat's heart beats nearly twice as fast as a human heart",
				"Cats spend nearly 1/3 of their waking hours cleaning themselves",
				"Grown cats have 30 teeth",
				"The largest cat breed is the Ragdoll",
				"Cats are extremely sensitive to vibrations",
				"The cat who holds the record for the longest non-fatal fall is Andy",
				"The richest cat is Blackie who was left 15 million by his owner, Ben Rea",
				"Around the world, cats take a break to nap a catnap 425 million times a day",
				"In homes with more than one cat, it is best to have cats of the opposite sex. They tend to be better housemates.",
				"Cats are unable to detect sweetness in anything they taste",
				"Perhaps the oldest cat breed on record is the Egyptian Mau, which is also the Egyptian language's word for cat",
				"In one litter of kittens, there could be multiple father cats",
				"Teeth of cats are sharper when they're kittens. After six months, they lose their needle-sharp milk teeth",
				"Collectively, kittens yawn about 200 million time per hour",
				"According to the International Species Information Service, there are only three Marbled Cats still in existence worldwide.  One lives in the United States.",
				"Cats show affection and mark their territory by rubbing on people. Glands on their face, tail and paws release a scent to make its mark",
				"Maine Coons are the most massive breed of house cats. They can weigh up to around 24 pounds",
				"If you killed a cat in the ages of Pharaoh, you could've been put to death",
				"Most cats will eat 7 to 20 small meals a day. This interesting fact is brought to you by Nature's Recipe",
				"Most cats don't have eyelashes",
				"Call them wide-eyes: cats are the mammals with the largest eyes",
				"Cats who eat too much tuna can become addicted, which can actually cause a Vitamin E deficiency",
				"Cats can pick up on your tone of voice, so sweet-talking to your cat has more of an impact than you think",
				"Some cats can survive falls from as high up as 65 feet or more",
				"Genetically, cats' brains are more similar to that of a human than a dog's brain",
				"If your cat's eyes are closed, it's not necessarily because it's tired. A sign of closed eyes means your cat is happy or pleased",
				"Cats CAN be lefties and righties, just like us. More than forty percent of them are, leaving some ambidextrous",
				"Cats have the skillset that makes them able to learn how to use a toilet",
				"Each side of a cat's face has about 12 whiskers",
				"Landing on all fours is something typical to cats thanks to the help of their eyes and special balance organs in their inner ear. These tools help them straighten themselves in the air and land upright on the ground.",
				"Eating grass rids a cats' system of any fur and helps with digestion",
				"Cats have 24 more bones than humans",
				"Black cats aren't an omen of ill fortune in all cultures. In the UK and Australia, spotting a black cat is good luck",
				"The Maine Coon is appropriately the official State cat of its namesake state",
				"The world's most fertile cat, whose name was Dusty, gave birth to 420 kittens in her lifetime",
				"Sometimes called the Canadian Hairless, the Sphynx is the first cat breed that has lasted this longthe breed has been around since 1966",
				"Sir Isaac Newton, among his many achievements, invented the cat flap door",
				"In North America, cats are a more popular pet than dogs. Nearly 73 million cats and 63 million dogs are kept as household pets",
				"Today, cats are living twice as long as they did just 50 years ago",
				"Outdoor cats' lifespan averages at about 3 to 5 years; indoor cats have lives that last 16 years or more",
				"Cats have the cognitive ability to sense a human's feelings and overall mood",
				"Cats prefer their food at room temperaturenot too hot, not too cold",
				"Bobtails are known to have notably short tails -- about half or a third the size of the average cat",
				"A fingerprint is to a human as a nose is to a cat",
				"Cats have over 100 sounds in their vocal repertoire, while dogs only have 10",
				"Cats came to the Americas from Europe as pest controllers in the 1750s",
				"According to the Association for Pet Obesity Prevention (APOP), about 50 million of our cats are overweight",
				"Cats use their whiskers to measure openings, indicate mood and general navigation",
				"Blue-eyed cats have a high tendency to be deaf, but not all cats with blue eyes are deaf",
				"Ancient Egyptians first adored cats for their finesse in killing rodentsas far back as 4,000 years ago",
				"The color of York Chocolates becomes richer with age. Kittens are born with a lighter coat than the adults",
				"Because of widespread cat smuggling in ancient Egypt, the exportation of cats was a crime punishable by death",
				"Cats actually have dreams, just like us. They start dreaming when they reach a week old",
				"It is important to include fat in your cat's diet because they're unable to make the nutrient in their bodies on their own",
				"A cat's field of vision does not cover the area right under its nose",
				"Talk about Facetime: Cats greet one another by rubbing their noses together",
				"Cats sleep 16 hours of any given day",
				"Although it is known to be the tailless cat, the Manx can be born with a stub or a short tail",
				"A Selkirk slowly loses its naturally-born curly coat, but it grows again when the cat is around 8 months",
				"A cat's heart beats almost double the rate of a human heart, from 110 to 140 beats per minute",
				"Ragdoll cats live up to their name: they will literally go limp, with relaxed muscles, when lifted by a human",
				"Unlike most other cats, the Turkish Van breed has a water-resistant coat and enjoys being in water",
				"Webbed feet on a cat? The Peterbald's got 'em! They make it easy for the cat to get a good grip on things with skill",
				"Despite appearing like a wild cat, the Ocicat does not have an ounce of wild blood",
				"Cat's back claws aren't as sharp as the claws on their front paws",
				"A group of kittens is called a kindle, and clowder is a term that refers to a group of adult cats",
				"A third of cats' time spent awake is usually spent cleaning themselves",
				"A female cat is also known to be called a queen or a molly",
				"Want to call a hairball by its scientific name? Next time, say the word bezoar",
				"Cats have a 5 toes on their front paws and 4 on each back paw",
				"In multi-pet households, cats are able to get along especially well with dogs if they're introduced when the cat is under 6 months old and the dog is under one year old",
				"Twenty-five percent of cat owners use a blow drier on their cats after bathing",
				"Rather than nine months, cats' pregnancies last about nine weeks",
				"It has been said that the Ukrainian Levkoy has the appearance of a dog, due to the angles of its face",
				"A cat can reach up to five times its own height per jump",
				"Cats have a strong aversion to anything citrus",
				"Cats would rather starve themselves than eat something they don't like. This means they will refuse an unpalatable -- but nutritionally complete -- food for a prolonged period",
				"The Snow Leopard, a variety of the California Spangled Cat, always has blue eyes",
				"The two outer layers of a cat's hair are called, respectively, the guard hair and the awn hair",
				"When a household cat died in ancient Egypt, its owners showed their grief by shaving their eyebrows",
				"Caution during Christmas: poinsettias may be festive, but theyre poisonous to cats",
				"Most kittens are born with blue eyes, which then turn color with age",
				"A cat's meow is usually not directed at another cat, but at a human. To communicate with other cats, they will usually hiss, purr and spit.",
				"According to the Guinness World Records, the largest domestic cat litter totaled at 19 kittens, four of them stillborn",
				"As temperatures rise, so do the number of cats. Cats are known to breed in warm weather, which leads many animal advocates worried about the plight of cats under Global Warming.",
				"Cats' rough tongues enable them to clean themselves efficiently and to lick clean an animal bone",
				"Most cat litters contain four to six kittens"
			]
		},
		{
			"intent": "agent.randomdogfacts",
			"utterances": [
				"facts about dogs",
				"tell me a random fact about a dog",
				"random dog fact",
				"say a random dog fact"
			],
			"answers": [
				"Puppies have 28 teeth and adult dogs have 42.",
				"Hollywoods first and arguably best canine superstar was Rin Tin Tin, a five-day-old German Shepherd found wounded in battle in WWI France and adopted by an American soldier, Lee Duncan. He would sign his own contracts with his paw print.",
				"Spiked dog collars were used to protect dogs' throats from wolf attacks in ancient Greece.",
				"Chocolate contains a substance known as theobromine (similar to caffeine) which can kill dogs or, at the very least, make them violently ill.",
				"A dog's whiskers are used as sensing devices.",
				"Dogs judge objects first by their movement, then by their brightness, and lastly by their shape.",
				"n ancient China, an emperor's last line of defense was a small Pekingese dog literally hidden up his sleeve.",
				"Greyhounds appear to be the most ancient dog breed. \"Greyhound\" comes from a mistake in translating the early German name Greishund, which means \"old (or ancient) dog,\" not from the color gray.",
				"There are about 400 million dogs in the world.",
				"Dogs with little human contact in the first three months typically dont make good pets.",
				"Endal was the first dog to ride on the London Eye (the characteristic ferris wheel in London, England), and was also the first known dog to successfully use a ATM machine.",
				"Dogs only sweat glands are between their paw pads.",
				"Dogs can count up to five and can perform simple mathematical calculations.",
				"Dogs can see best at dawn and dusk.",
				"Zorba, an English mastiff, is the biggest dog ever recorded. He weighed 343 pounds and measured 8 3\" from his nose to his tail.",
				"Dogs have a wet nose to collect more of the tiny droplets of smelling chemicals in the air.",
				"It pays to be a lap dog. Three dogs (from First Class cabins!) survived the sinking of the Titanic  two Pomeranians and one Pekingese.",
				"A dogs vision is not fully developed until after the first month.",
				"The smallest dog on record was a matchbox-size Yorkshire Terrier. It was 2.5\" tall at the shoulder, 3.5\" from nose tip to tail, and weighed only 4 ounces.",
				"The Beagle came into prominence in the 1300s and 1400s during the days of King Henry VII of England. Elizabeth I was fond of Pocket Beagles, which were only 9\" high.",
				"Chase that tail! Dogs chase their tails for a variety of reasons: curiosity, exercise, anxiety, predatory instinct or, they might have fleas! If your dog is chasing his tail excessively, talk with your vet.",
				"Irish Wolfhounds, the tallest breed, are 30 to 35 inches tall.",
				"Growing up. While the Chow Chow dogs are well known for their distinctive blue-black tongues, theyre actually born with pink tongues. They turn blue-black at 8-10 weeks of age.",
				"Greyhounds are the fastest dogs on earth, with speeds of up to 45 miles per hour.",
				"Rock star Ozzy Osborne saved his wife Sharons Pomeranian from a coyote by tackling and wresting the coyote until it released the dog.",
				"In addition to \"formal\" forms of dog training (operant conditioning, reinforcement, or classical conditioning), dogs are able to learn merely from observation.",
				"Some dogs can smell dead bodies under water, where termites are hiding, and natural gas buried under 40 feet of dirt. They can even detect cancer that is too small to be detected by a doctor and can find lung cancer by sniffing a persons breath.",
				"U.S. Customs dogs \"Rocky\" and \"Barco\" were so good at patrolling the border that Mexican drug lords put a $300,000 bounty on their heads.",
				"Different smells in the a dogs urine can tell other dogs whether the dog leaving the message is female or male, old or young, sick or healthy, happy or angry.",
				"Dogs can see in color, though they most likely see colors similar to a color-blind human. They can see better when the light is low.",
				"One of Shakespeares most mischievous characters is Crab, the dog belonging to Launce in the Two Gentlemen of Verona. The word \"watchdog\" is first found in The Tempest.",
				"The oldest dog on record  a Queensland Heeler named Bluey  was 29 years, 5 months old.",
				"Teddy Roosevelts dog, Pete, ripped a French ambassadors pants off at the White House.",
				"Obesity is the top health problem among dogs.",
				"The Mayans and Aztecs symbolized every tenth day with the dog, and those born under this sign were believed to have outstanding leadership skills.",
				"The Labrador Retriever has been the most popular dog breed since 1991.",
				"Dogs nose prints are as unique as a humans finger prints, and can be used to accurately identify them.",
				"When \"Bobbie,\" a Collie/Shepherd mix, was accidentally abandoned on a family vacation, he traveled 2,551 miles over six months to return to his home.",
				"Analysis of the dog genome demonstrate only 4 major types of dogs: \"Old Lineage Dogs,\" \"Mastiff-type Dogs,\" \"Herding Dogs,\" and \"Modern Hunting Dogs.\"",
				"Davy Crockett had a dog named Sport.",
				"Dogs live an average of 15 years.",
				"The dog was frequently depicted in Greek art, including Cerberus, the three-headed hound guarding the entrance to the underworld, and the hunting dogs which accompanied the virgin goddess of the chase, Diana.",
				"Puppies sleep 90% of the day for their first few weeks.",
				"Many foot disorders in dogs are simply an issue of too-long toenails.",
				"A Russian dog named Laika was the first animal in space, traveling around Earth in 1957.",
				"Move over Rover! 45% of dogs sleep in their owners bed (were pretty sure a large percentage also hog the blankets!)",
				"Dogs with a flesh colored nose is said to have a \"Dudley Nose.\"",
				"Fifty-eight percent of people put pets in family and holiday portraits.",
				"The U.S. has the highest dog population in the world.",
				"Newfoundlands are great swimmers because of their webbed feet.",
				"The Berger Picard, Miniature American Shepherd and Lagotto Romagnolo are the newest dog breeds recognized by the American Kennel Club in 2015.",
				"During the Middle Ages, mixed breeds of peasants dogs were required to wear blocks around their necks to keep them from breeding with noble hunting dogs. Purebred dogs were very expensive and hunting became the province of the rich.",
				"The Chihuahua was named after the state in Mexico where they were discovered.",
				"Teams of dogs compete for the fastest time without errors in Flyball races.",
				"Three of the 12 dogs on the Titanic survived.",
				"Bichons, Portuguese Water Dogs, Kerry Blue Terriers, Maltese and Poodles are all good choices if you have allergies since they shed less than other breeds.",
				"Petting a dog can lower your blood pressure.",
				"One survey reports that 33% of dog owners admit they talk to their dogs on the phone or leave messages on answering machines while they are away..",
				"Dogs are naturally submissive to any creature with a higher pack status.",
				"Dogs are naturally submissive to any creature with higher pack status, human or canine.",
				"President Lyndon Johnson had two beagles named Him and Her.",
				"Humans can detect sounds at 20,000 times per second, while dogs can sense frequencies of 30,000 times per second.",
				"The most dogs ever owned by one person were 5,000 Mastiffs owned by Kublai Khan.",
				"There are an estimated 400 million dogs in the world.",
				"More than one in three U.S. families owns a dog.",
				"Dogs don't enjoy being hugged as much as humans and other primates. Canines interpret putting a limb over another animal as a sign of dominance.",
				"The phrase \"raining cats and dogs\" originated in 17th century England when it is believed that many cats and dogs drowned during heavy periods of rain.",
				"The ancient religion Zoroastrianism includes in its religious text titled the Zend Avesta a section devoted to the care and breeding of dogs.",
				"The bible mentions dogs 14 times.",
				"Boxers are so named because of their manner of playing using their front paws.",
				"During the Renaissance, detailed portraits of the dog as a symbol of fidelity and loyalty appeared in mythological, allegorical, and religious art throughout Europe, including works by Leonardo da Vinci, Diego Velzquez, Jan van Eyck, and Albrecht Durer.",
				"Petting dogs is proven to lower blood pressure of dog owners.",
				"Smaller breeds mature faster than larger breeds.",
				"Dogs have no sense of time.",
				"In 2001, it was estimated that there are approximately 400 million dogs in the world.",
				"At the end of WWI, the German government trained the first guide dogs for war-blinded soldiers.",
				"Dogs sleep for an average of 10 hours per day.",
				"Dogs have been used since the 1700s for therapy.",
				"Smaller breeds of dogs mature faster than larger breeds.",
				"A dogs pregnancy lasts for approximately 60 days.",
				"Seventy percent of people sign their pets name on greeting and holiday cards.",
				"French poodles did not originate in France but in Germany (\"poodle\" comes from the German pudel or pudelhund, meaning \"splashing dog\"). Some scholars speculate the poodles puffs of hair evolved when hunters shaved the poodle for more efficient swimming, while leaving the pom-poms around the major joints to keep them warm.",
				"In 1957, Laika became the first living being in space via an earth satellite and JFKs terrier, Charlie, fathered 4 puppies with Laikas daughter.",
				"The most popular dog breed in Canada, U.S., and Great Britain is the Labrador retriever.",
				"Although it was once illegal to keep dogs as pets in Iceland's capital city, the laws have been relaxed.",
				"The Basenji is the only barkless dog.",
				"Dogs are capable of understanding up to 250 words and gestures, can count up to five and can perform simple mathematical calculations. The average dog is as intelligent as a two-year-old child.",
				"Basset Hounds cannot swim.",
				"The phrase \"raining cats and dogs\" originated in seventeenth-century England. During heavy rainstorms, many homeless animals would drown and float down the streets, giving the appearance that it had actually rained cats and dogs.",
				"The Labrador is so popular, in 2006 there were approximately 3-5 times more Labs as there were German Shepherds or Golden Retrievers.",
				"Male dogs will raise their legs while urinating to aim higher on a tree or lamppost because they want to leave a message that they are tall and intimidating. Some wild dogs in Africa try to run up tree trunks while they are urinating to appear to be very large.",
				"Even with their poor eyesight, dogs can still see better at night than humans do.",
				"An elderly woman was saved by her 12-pound Yorkshire Terrier, who fought off an 80- pound Akita, and survived with only 9 stitches.",
				"Unlike cats, dogs are not exclusively carnivores: they can adapt to different foods, and a percentage of their diets can be fruits and vegetables.",
				"Female wolves have been known to travel great distances to regurgitate full meals for their hungry pups.",
				"There are hundreds of breeds of dogs.",
				"In Egypt, a person bitten by a rabid dog was encouraged to eat the roasted liver of a dog infected with rabies to avoid contracting the disease. The tooth of a dog infected with rabies would also be put in a band tied to the arm of the person bitten. The menstrual blood of a female dog was used for hair removal, while dog genitals were used for preventing the whitening of hair.",
				"Dogs can get jealous when their humans display affection toward someone or something else.",
				"Weird dog laws include allowing police offers in Palding, Ohio, to bite a dog to quiet it. In Ventura County, California, cats and dogs are not allowed to have sex without a permit.",
				"The largest dog was an English Mastiff who weighed 343 pounds."
			]
		},
		{
			"intent": "None",
			"utterances": [
				"tell me a name",
				"nothing much",
				"how much",
				"much",
				"tell me a dog name",
				"say a good dog name",
				"say a name",
				"random",
				"bitcoin",
				"btc",
				"quote",
				"quotes",
				"dogs",
				"cats",
				"dog",
				"cat",
				"who",
				"are",
				"you",
				"me",
				"joke",
				"knock",
				"roll",
				"dice",
				"jokes",
				"norris",
				"morris",
				"rat",
				"timer",
				"work",
				"bad",
				"coin",
				"bit coin",
				"flip",
				"weather",
				"time",
				"chuck",
				"jared",
				"who",
				"whos",
				"who/'s",
				"quarter",
				"sadsadssddsad",
				"i dmsfmfmsdfsdf msa",
				"sddds asadasd adfda sa",
				"ppppppppsdfdsfdsfdsffds",
				"zjhdfgjkfgdfdfkdfgfjd",
				"what should I do?"
			],
			"answers": [
				"I missed what you said.",
				"Sorry, I didn't get that.",
				"Sorry, what was that?",
				"What was that?",
				"I didn't get that.",
				"I missed that.",
				"I am not sure I understand that!",
				"I am not sure I understood that!",
				"I am not sure I understand you!",
				"Sorry I don't understand."
			]
		}
	]
}
